[
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Absorb Elements",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 1 Abjuration",
			"rule",
			"property | Casting Time | Reaction, which you take when you take acid, cold, fire, lightning, or thunder damage",
			"property | Range | Self",
			"property | Components | S",
			"property | Duration | 1 round",
			"rule",
			"text | The spell captures some of the incoming energy, lessening its effect on you and storing it for your next melee attack. You have resistance to the triggering damage type until the start of your next turn. Also, the first time you hit with a melee attack on your next turn, the target takes an extra 1d6 damage of the triggering type, and the spell ends.",
			"section | At higher levels",
			"text | When you cast this spell using a spell slot of 2nd level or higher, the extra damage increases by 1d6 for each slot level above 1st."
		],
		"tags": [
			"spell",
			"XGE",
			"1st level",
			"Abjuration",
			"Druid",
			"Ranger",
			"Sorcerer",
			"Wizard",
			"Artificer",
			"Druid",
			"Ranger",
			"Sorcerer",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Aid",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Abjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 30 feet",
			"property | Components | V, S, M (a strip of white cloth)",
			"property | Duration | 8 hours",
			"rule",
			"text | Choose up to three creatures within range. Each target's Hit Point maximum and current Hit Points increase by 5 for the duration.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | Each target's Hit Points increase by 5 for each spell slot level above 2."
		],
		"tags": [
			"spell",
			"PHB'24",
			"2nd level",
			"Abjuration",
			"Bard",
			"Cleric",
			"Druid",
			"Ranger",
			"Paladin",
			"Artificer"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Air Bubble",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 60 feet",
			"property | Components | S",
			"property | Duration | 24 hours",
			"rule",
			"text | You create a spectral globe around the head of a willing creature you can see within range. The globe is filled with fresh air that lasts until the spell ends. If the creature has more than one head, the globe of air appears around only one of its heads (which is all the creature needs to avoid suffocation, assuming that all its heads share the same respiratory system).",
			"section | At higher levels",
			"text | When you cast this spell using a spell slot of 3rd level or higher, you can create two additional globes of fresh air for each slot level above 2nd."
		],
		"tags": [
			"spell",
			"AAG",
			"2nd level",
			"Conjuration",
			"Druid",
			"Ranger",
			"Sorcerer",
			"Wizard",
			"Artificer",
			"Druid",
			"Ranger",
			"Sorcerer",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Alustriel's Mooncloak",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 5 Abjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V, S, M (a moonstone worth 50+ GP)",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | For the duration, moonlight fills a 20-foot Emanation originating from you with Dim Light. While in that area, you and your allies have Half Cover and Resistance to Cold, Lightning, and Radiant damage.",
			"text | While the spell lasts, you can use one of the following options, ending the spell immediately:",
			"bullet | <b>Liberation.</b> When you fail a saving throw to avoid or end the Frightened, Grappled, or Restrained condition, you can take a Reaction to succeed on the save instead.",
			"bullet | <b>Respite.</b> As a Magic action, you or an ally within the area regains Hit Points equal to 4d10 plus your spellcasting ability modifier."
		],
		"tags": [
			"spell",
			"FRHoF",
			"5th level",
			"Abjuration",
			"Bard",
			"Druid",
			"Ranger",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Animal Friendship",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 1 Enchantment",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 30 feet",
			"property | Components | V, S, M (a morsel of food)",
			"property | Duration | 24 hours",
			"rule",
			"text | Target a Beast that you can see within range. The target must succeed on a Wisdom saving throw or have the Charmed condition for the duration. If you or one of your allies deals damage to the target, the spells ends.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | You can target one additional Beast for each spell slot level above 1."
		],
		"tags": [
			"spell",
			"PHB'24",
			"1st level",
			"Enchantment",
			"Bard",
			"Druid",
			"Ranger"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Animal Messenger",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Enchantment",
			"rule",
			"property | Casting Time | Action or Ritual",
			"property | Range | 30 feet",
			"property | Components | V, S, M (a morsel of food)",
			"property | Duration | 24 hours",
			"rule",
			"text | A Tiny Beast of your choice that you can see within range must succeed on a Charisma saving throw, or it attempts to deliver a message for you (if the target's Challenge Rating isn't 0, it automatically succeeds). You specify a location you have visited and a recipient who matches a general description, such as \"a person dressed in the uniform of the town guard\" or \"a red-haired dwarf wearing a pointed hat.\" You also communicate a message of up to twenty-five words. The Beast travels for the duration toward the specified location, covering about 25 miles per 24 hours or 50 miles if the Beast can fly.",
			"text | When the Beast arrives, it delivers your message to the creature that you described, mimicking your communication. If the Beast doesn't reach its destination before the spell ends, the message is lost, and the Beast returns to where you cast the spell.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The spell's duration increases by 48 hours for each spell slot level above 2."
		],
		"tags": [
			"spell",
			"PHB'24",
			"2nd level",
			"Enchantment",
			"Bard",
			"Druid",
			"Ranger",
			"ritual"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Animal Shapes",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 8 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 30 feet",
			"property | Components | V, S",
			"property | Duration | 24 hours",
			"rule",
			"text | Choose any number of willing creatures that you can see within range. Each target shape-shifts into a Large or smaller Beast of your choice that has a Challenge Rating of 4 or lower. You can choose a different form for each target. On later turns, you can take a Magic action to transform the targets again.",
			"text | A target's game statistics are replaced by the chosen Beast's statistics, but the target retains its creature type; Hit Points; Hit Point Dice; alignment; ability to communicate; and Intelligence, Wisdom, and Charisma scores. The target's actions are limited by the Beast form's anatomy, and it can't cast spells. The target's equipment melds into the new form, and the target can't use any of that equipment while in that form.",
			"text | The target gains a number of Temporary Hit Points equal to the Hit Points of the first form into which it shape-shifts. These Temporary Hit Points vanish if any remain when the spell ends. The transformation lasts for the duration or until the target ends it as a Bonus Action."
		],
		"tags": [
			"spell",
			"PHB'24",
			"8th level",
			"Transmutation",
			"Druid"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Antilife Shell",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 5 Abjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 1 hour",
			"rule",
			"text | An aura extends from you in a 10-foot Emanation for the duration. The aura prevents creatures other than Constructs and Undead from passing or reaching through it. An affected creature can cast spells or make attacks with Ranged or Reach weapons through the barrier.",
			"text | If you move so that an affected creature is forced to pass through the barrier, the spell ends."
		],
		"tags": [
			"spell",
			"PHB'24",
			"5th level",
			"Abjuration",
			"Druid",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Antipathy/Sympathy",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 8 Enchantment",
			"rule",
			"property | Casting Time | 1 hour",
			"property | Range | 60 feet",
			"property | Components | V, S, M (a mix of vinegar and honey)",
			"property | Duration | 10 days",
			"rule",
			"text | As you cast the spell, choose whether it creates antipathy or sympathy, and target one creature or object that is Huge or smaller. Then specify a kind of creature, such as red dragons, goblins, or vampires. A creature of the chosen kind makes a Wisdom saving throw when it comes within 120 feet of the target. Your choice of antipathy or sympathy determines what happens to a creature when it fails that save:",
			"bullet | <b>Antipathy.</b> The creature has the Frightened condition. The Frightened creature must use its movement on its turns to get as far away as possible from the target, moving by the safest route.",
			"bullet | <b>Sympathy.</b> The creature has the Charmed condition. The Charmed creature must use its movement on its turns to get as close as possible to the target, moving by the safest route. If the creature is within 5 feet of the target, the creature can't willingly move away. If the target damages the Charmed creature, that creature can make a Wisdom saving throw to end the effect, as described below.",
			"description | Ending the Effect | If the Frightened or Charmed creature ends its turn more than 120 feet away from the target, the creature makes a Wisdom saving throw. On a successful save, the creature is no longer affected by the target. A creature that successfully saves against this effect is immune to it for 1 minute, after which it can be affected again."
		],
		"tags": [
			"spell",
			"PHB'24",
			"8th level",
			"Enchantment",
			"Bard",
			"Druid",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Augury",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Divination",
			"rule",
			"property | Casting Time | 1 minute or Ritual",
			"property | Range | Self",
			"property | Components | V, S, M (specially marked sticks, bones, cards, or other divinatory tokens worth 25+ GP)",
			"property | Duration | Instantaneous",
			"rule",
			"text | You receive an omen from an otherworldly entity about the results of a course of action that you plan to take within the next 30 minutes. The DM chooses the omen from the Omens table.",
			"text | <b>Omens</b>",
			"text | Omen｜For Results That Will Be...",
			"text | Weal｜Good",
			"text | Woe｜Bad",
			"text | Weal and woe｜Good and bad",
			"text | Indifference｜Neither good nor bad",
			"text | The spell doesn't account for circumstances, such as other spells, that might change the results.",
			"text | If you cast the spell more than once before finishing a Long Rest, there is a cumulative 25 percent chance for each casting after the first that you get no answer."
		],
		"tags": [
			"spell",
			"PHB'24",
			"2nd level",
			"Divination",
			"Cleric",
			"Druid",
			"Wizard",
			"ritual"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Aura of Vitality",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 3 Abjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | An aura radiates from you in a 30-foot Emanation for the duration. When you create the aura and at the start of each of your turns while it persists, you can restore 2d6 Hit Points to one creature in it."
		],
		"tags": [
			"spell",
			"PHB'24",
			"3rd level",
			"Abjuration",
			"Cleric",
			"Druid",
			"Paladin",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Awaken",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 5 Transmutation",
			"rule",
			"property | Casting Time | 8 hours",
			"property | Range | Touch",
			"property | Components | V, S, M (an agate worth 1,000+ GP, which the spell consumes)",
			"property | Duration | Instantaneous",
			"rule",
			"text | You spend the casting time tracing magical pathways within a precious gemstone, and then touch the target. The target must be either a Beast or Plant creature with an Intelligence of 3 or less or a natural plant that isn't a creature. The target gains an Intelligence of 10 and the ability to speak one language you know. If the target is a natural plant, it becomes a Plant creature and gains the ability to move its limbs, roots, vines, creepers, and so forth, and it gains senses similar to a human's. The DM chooses statistics appropriate for the awakened Plant, such as the statistics for the Awakened Shrub or Awakened Tree in the Monster Manual.",
			"text | The awakened target has the Charmed condition for 30 days or until you or your allies deal damage to it. When that condition ends, the awakened creature chooses its attitude toward you."
		],
		"tags": [
			"spell",
			"PHB'24",
			"5th level",
			"Transmutation",
			"Bard",
			"Druid"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Barkskin",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Transmutation",
			"rule",
			"property | Casting Time | Bonus action",
			"property | Range | Touch",
			"property | Components | V, S, M (a handful of oak bark)",
			"property | Duration | 1 hour",
			"rule",
			"text | You touch a willing creature. Until the spell ends, the target's skin assumes a bark-like appearance, and the target has an Armor Class of 17 if its AC is lower than that."
		],
		"tags": [
			"spell",
			"PHB'24",
			"2nd level",
			"Transmutation",
			"Druid",
			"Ranger"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Beast Bond",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 1 Divination",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Touch",
			"property | Components | V, S, M (a bit of fur wrapped in a cloth)",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | You establish a telepathic link with one beast you touch that is friendly to you or charmed by you. The spell fails if the beast's Intelligence score is 4 or higher. Until the spell ends, the link is active while you and the beast are within line of sight of each other. Through the link, the beast can understand your telepathic messages to it, and it can telepathically communicate simple emotions and concepts back to you. While the link is active, the beast gains advantage on attack rolls against any creature within 5 feet of you that you can see."
		],
		"tags": [
			"spell",
			"XGE",
			"1st level",
			"Divination",
			"Druid",
			"Ranger",
			"Druid",
			"Ranger",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Beast Sense",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Divination",
			"rule",
			"property | Casting Time | Action or Ritual",
			"property | Range | Touch",
			"property | Components | S",
			"property | Duration | Concentration, up to 1 hour",
			"rule",
			"text | You touch a willing Beast. For the duration, you can perceive through the Beast's senses as well as your own. When perceiving through the Beast's senses, you benefit from any special senses it has."
		],
		"tags": [
			"spell",
			"PHB'24",
			"2nd level",
			"Divination",
			"Druid",
			"Ranger",
			"concentration",
			"ritual"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Befuddlement",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 8 Enchantment",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 150 feet",
			"property | Components | V, S, M (a key ring with no keys)",
			"property | Duration | Instantaneous",
			"rule",
			"text | You blast the mind of a creature that you can see within range. The target makes an Intelligence saving throw.",
			"text | On a failed save, the target takes 10d12 Psychic damage and can't cast spells or take the Magic action. At the end of every 30 days, the target repeats the save, ending the effect on a success. The effect can also be ended by the Greater Restoration, Heal, or Wish spell.",
			"text | On a successful save, the target takes half as much damage only."
		],
		"tags": [
			"spell",
			"PHB'24",
			"8th level",
			"Enchantment",
			"Bard",
			"Druid",
			"Warlock",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Blight",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 4 Necromancy",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 30 feet",
			"property | Components | V, S",
			"property | Duration | Instantaneous",
			"rule",
			"text | A creature that you can see within range makes a Constitution saving throw, taking 8d8 Necrotic damage on a failed save or half as much damage on a successful one. A Plant creature automatically fails the save.",
			"text | Alternatively, target a nonmagical plant that isn't a creature, such as a tree or shrub. It doesn't make a save; it simply withers and dies.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The damage increases by 1d8 for each spell slot level above 4."
		],
		"tags": [
			"spell",
			"PHB'24",
			"4th level",
			"Necromancy",
			"Druid",
			"Sorcerer",
			"Warlock",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Bones of the Earth",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 6 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 120 feet",
			"property | Components | V, S",
			"property | Duration | Instantaneous",
			"rule",
			"text | You cause up to six pillars of stone to burst from places on the ground that you can see within range. Each pillar is a cylinder that has a diameter of 5 feet and a height of up to 30 feet. The ground where a pillar appears must be wide enough for its diameter, and you can target the ground under a creature if that creature is Medium or smaller. Each pillar has AC 5 and 30 hit points. When reduced to 0 hit points, a pillar crumbles into rubble, which creates an area of difficult terrain with a 10-foot radius that lasts until the rubble is cleared. Each 5-foot-diameter portion of the area requires at least 1 minute to clear by hand.",
			"text | If a pillar is created under a creature, that creature must succeed on a Dexterity saving throw or be lifted by the pillar. A creature can choose to fail the save.",
			"text | If a pillar is prevented from reaching its full height because of a ceiling or other obstacle, a creature on the pillar takes 6d6 bludgeoning damage and is restrained, pinched between the pillar and the obstacle. The restrained creature can use an action to make a Strength or Dexterity check (the creature's choice) against the spell's save DC. On a success, the creature is no longer restrained and must either move off the pillar or fall off it.",
			"section | At higher levels",
			"text | When you cast this spell using a spell slot of 7th level or higher, you can create two additional pillars for each slot level above 6th."
		],
		"tags": [
			"spell",
			"XGE",
			"6th level",
			"Transmutation",
			"Druid",
			"Druid"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Call Lightning",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 3 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 120 feet",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | A storm cloud appears at a point within range that you can see above yourself. It takes the shape of a Cylinder that is 10 feet tall with a 60-foot radius.",
			"text | When you cast the spell, choose a point you can see under the cloud. A lightning bolt shoots from the cloud to that point. Each creature within 5 feet of that point makes a Dexterity saving throw, taking 3d10 Lightning damage on a failed save or half as much damage on a successful one.",
			"text | Until the spell ends, you can take a Magic action to call down lightning in that way again, targeting the same point or a different one.",
			"text | If you're outdoors in a storm when you cast this spell, the spell gives you control over that storm instead of creating a new one. Under such conditions, the spell's damage increases by 1d10.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The damage increases by 1d10 for each spell slot level above 3."
		],
		"tags": [
			"spell",
			"PHB'24",
			"3rd level",
			"Conjuration",
			"Druid",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Charm Monster",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 4 Enchantment",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 30 feet",
			"property | Components | V, S",
			"property | Duration | 1 hour",
			"rule",
			"text | One creature you can see within range makes a Wisdom saving throw. It does so with Advantage if you or your allies are fighting it. On a failed save, the target has the Charmed condition until the spell ends or until you or your allies damage it. The Charmed creature is Friendly to you. When the spell ends, the target knows it was Charmed by you.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | You can target one additional creature for each spell slot level above 4."
		],
		"tags": [
			"spell",
			"PHB'24",
			"4th level",
			"Enchantment",
			"Bard",
			"Druid",
			"Sorcerer",
			"Warlock",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Charm Person",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 1 Enchantment",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 30 feet",
			"property | Components | V, S",
			"property | Duration | 1 hour",
			"rule",
			"text | One Humanoid you can see within range makes a Wisdom saving throw. It does so with Advantage if you or your allies are fighting it. On a failed save, the target has the Charmed condition until the spell ends or until you or your allies damage it. The Charmed creature is Friendly to you. When the spell ends, the target knows it was Charmed by you.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | You can target one additional creature for each spell slot level above 1."
		],
		"tags": [
			"spell",
			"PHB'24",
			"1st level",
			"Enchantment",
			"Bard",
			"Druid",
			"Sorcerer",
			"Warlock",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Commune with Nature",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 5 Divination",
			"rule",
			"property | Casting Time | 1 minute or Ritual",
			"property | Range | Self",
			"property | Components | V, S",
			"property | Duration | 1 minute",
			"rule",
			"text | You commune with nature spirits and gain knowledge of the surrounding area. In the outdoors, the spell gives you knowledge of the area within 3 miles of you. In caves and other natural underground settings, the radius is limited to 300 feet. The spell doesn't function where nature has been replaced by construction, such as in castles and settlements.",
			"text | Choose three of the following facts; you learn those facts as they pertain to the spell's area:",
			"bullet | Locations of settlements",
			"bullet | Locations of portals to other planes of existence",
			"bullet | Location of one Challenge Rating 10+ creature (DM's choice) that is a Celestial, an Elemental, a Fey, a Fiend, or an Undead",
			"bullet | The most prevalent kind of plant, mineral, or Beast (you choose which to learn)",
			"bullet | Locations of bodies of water",
			"text | For example, you could determine the location of a powerful monster in the area, the locations of bodies of water, and the locations of any towns."
		],
		"tags": [
			"spell",
			"PHB'24",
			"5th level",
			"Divination",
			"Druid",
			"Ranger",
			"ritual"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Cone of Cold",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 5 Evocation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V, S, M (a small crystal or glass cone)",
			"property | Duration | Instantaneous",
			"rule",
			"text | You unleash a blast of cold air. Each creature in a 60-foot Cone originating from you makes a Constitution saving throw, taking 8d8 Cold damage on a failed save or half as much damage on a successful one. A creature killed by this spell becomes a frozen statue until it thaws.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The damage increases by 1d8 for each spell slot level above 5."
		],
		"tags": [
			"spell",
			"PHB'24",
			"5th level",
			"Evocation",
			"Druid",
			"Sorcerer",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Confusion",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 4 Enchantment",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 90 feet",
			"property | Components | V, S, M (three nut shells)",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | Each creature in a 10-foot-radius Sphere centered on a point you choose within range must succeed on a Wisdom saving throw, or that target can't take Bonus Actions or Reactions and must roll 1d10 at the start of each of its turns to determine its behavior for that turn, consulting the table below.",
			"text | 1d10｜Behavior for the Turn",
			"text | 1｜The target doesn't take an action, and it uses all its movement to move. Roll 1d4 for the direction: <b>1</b>, north; <b>2</b>, east; <b>3</b>, south; or <b>4</b>, west.",
			"text | 2-6｜The target doesn't move or take actions.",
			"text | 7-8｜The target doesn't move, and it takes the Attack action to make one melee attack against a random creature within reach. If none are within reach, the target takes no action.",
			"text | 9-10｜The target chooses its behavior.",
			"text | At the end of each of its turns, an affected target repeats the save, ending the spell on itself on a success.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The Sphere's radius increases by 5 feet for each spell slot level above 4."
		],
		"tags": [
			"spell",
			"PHB'24",
			"4th level",
			"Enchantment",
			"Bard",
			"Druid",
			"Sorcerer",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Conjure Animals",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 3 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 60 feet",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | You conjure nature spirits that appear as a Large pack of spectral, intangible animals in an unoccupied space you can see within range. The pack lasts for the duration, and you choose the spirits' animal form, such as wolves, serpents, or birds.",
			"text | You have Advantage on Strength saving throws while you're within 5 feet of the pack, and when you move on your turn, you can also move the pack up to 30 feet to an unoccupied space you can see.",
			"text | Whenever the pack moves within 10 feet of a creature you can see and whenever a creature you can see enters a space within 10 feet of the pack or ends its turn there, you can force that creature to make a Dexterity saving throw. On a failed save, the creature takes 3d10 Slashing damage. A creature makes this save only once per turn.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The damage increases by 1d10 for each spell slot level above 3."
		],
		"tags": [
			"spell",
			"PHB'24",
			"3rd level",
			"Conjuration",
			"Druid",
			"Ranger",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Conjure Elemental",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 5 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 60 feet",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | You conjure a Large, intangible spirit from the Elemental Planes that appears in an unoccupied space within range. Choose the spirit's element, which determines its damage type: air (Lightning), earth (Thunder), fire (Fire), or water (Cold). The spirit lasts for the duration.",
			"text | Whenever a creature you can see enters the spirit's space or starts its turn within 5 feet of the spirit, you can force that creature to make a Dexterity saving throw if the spirit has no creature Restrained. On failed save, the target takes 8d8 damage of the spirit's type, and the target has the Restrained condition until the spell ends. At the start of each of its turns, the Restrained target repeats the save. On a failed save, the target takes 4d8 damage of the spirit's type. On a successful save, the target isn't Restrained by the spirit.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The damage increases by 1d8 for each spell slot level above 5."
		],
		"tags": [
			"spell",
			"PHB'24",
			"5th level",
			"Conjuration",
			"Druid",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Conjure Fey",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 6 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 60 feet",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | You conjure a Medium spirit from the Feywild in an unoccupied space you can see within range. The spirit lasts for the duration, and it looks like a Fey creature of your choice. When the spirit appears, you can make one melee spell attack against a creature within 5 feet of it. On a hit, the target takes Psychic damage equal to 3d12 plus your spellcasting ability modifier, and the target has the Frightened condition until the start of your next turn, with both you and the spirit as the source of the fear.",
			"text | As a Bonus Action on your later turns, you can teleport the spirit to an unoccupied space you can see within 30 feet of the space it left and make the attack against a creature within 5 feet of it.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The damage increases by 1d12 for each spell slot level above 6."
		],
		"tags": [
			"spell",
			"PHB'24",
			"6th level",
			"Conjuration",
			"Druid",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Conjure Minor Elementals",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 4 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | You conjure spirits from the Elemental Planes that flit around you in a 15-foot Emanation for the duration. Until the spell ends, any attack you make deals an extra 2d8 damage when you hit a creature in the Emanation. This damage is Acid, Cold, Fire, or Lightning (your choice when you make the attack).",
			"text | In addition, the ground in the Emanation is Difficult Terrain for your enemies.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The damage increases by 1d8 for each spell slot level above 4."
		],
		"tags": [
			"spell",
			"PHB'24",
			"4th level",
			"Conjuration",
			"Druid",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Conjure Woodland Beings",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 4 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | You conjure nature spirits that flit around you in a 10-foot Emanation for the duration. Whenever the Emanation enters the space of a creature you can see and whenever a creature you can see enters the Emanation or ends its turn there, you can force that creature to make a Wisdom saving throw. The creature takes 5d8 Force damage on a failed save or half as much damage on a successful one. A creature makes this save only once per turn.",
			"text | In addition, you can take the Disengage action as a Bonus Action for the spell's duration.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The damage increases by 1d8 for each spell slot level above 4."
		],
		"tags": [
			"spell",
			"PHB'24",
			"4th level",
			"Conjuration",
			"Druid",
			"Ranger",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Contagion",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 5 Necromancy",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Touch",
			"property | Components | V, S",
			"property | Duration | 7 days",
			"rule",
			"text | Your touch inflicts a magical contagion. The target must succeed on a Constitution saving throw or take 11d8 Necrotic damage and have the Poisoned condition. Also, choose one ability when you cast the spell. While Poisoned, the target has Disadvantage on saving throws made with the chosen ability.",
			"text | The target must repeat the saving throw at the end of each of its turns until it gets three successes or failures. If the target succeeds on three of these saves, the spell ends on the target. If the target fails three of the saves, the spell lasts for 7 days on it.",
			"text | Whenever the Poisoned target receives an effect that would end the Poisoned condition, the target must succeed on a Constitution saving throw, or the Poisoned condition doesn't end on it."
		],
		"tags": [
			"spell",
			"PHB'24",
			"5th level",
			"Necromancy",
			"Cleric",
			"Druid"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Continual Flame",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Evocation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Touch",
			"property | Components | V, S, M (ruby dust worth 50+ GP, which the spell consumes)",
			"property | Duration | Until dispelled",
			"rule",
			"text | A flame springs from an object that you touch. The effect casts Bright Light in a 20-foot radius and Dim Light for an additional 20 feet. It looks like a regular flame, but it creates no heat and consumes no fuel. The flame can be covered or hidden but not smothered or quenched."
		],
		"tags": [
			"spell",
			"PHB'24",
			"2nd level",
			"Evocation",
			"Cleric",
			"Druid",
			"Wizard",
			"Artificer"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Control Flames",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Transmutation Cantrip",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 60 feet",
			"property | Components | S",
			"property | Duration | Instantaneous or 1 hour (see below)",
			"rule",
			"text | You choose nonmagical flame that you can see within range and that fits within a 5-foot cube. You affect it in one of the following ways:",
			"bullet | You instantaneously expand the flame 5 feet in one direction, provided that wood or other fuel is present in the new location.",
			"bullet | You instantaneously extinguish the flames within the cube.",
			"bullet | You double or halve the area of bright light and dim light cast by the flame, change its color, or both. The change lasts for 1 hour.",
			"bullet | You cause simple shapes—such as the vague form of a creature, an inanimate object, or a location—to appear within the flames and animate as you like. The shapes last for 1 hour.",
			"text | If you cast this spell multiple times, you can have up to three non-instantaneous effects created by it active at a time, and you can dismiss such an effect as an action."
		],
		"tags": [
			"spell",
			"XGE",
			"Cantrips",
			"Transmutation",
			"Druid",
			"Sorcerer",
			"Wizard",
			"Druid",
			"Sorcerer",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Control Water",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 4 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 300 feet",
			"property | Components | V, S, M (a mixture of water and dust)",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | Until the spell ends, you control any water inside an area you choose that is a Cube up to 100 feet on a side, using one of the following effects. As a Magic action on your later turns, you can repeat the same effect or choose a different one.",
			"description | Flood | You cause the water level of all standing water in the area to rise by as much as 20 feet. If you choose an area in a large body of water, you instead create a 20-foot tall wave that travels from one side of the area to the other and then crashes. Any Huge or smaller vehicles in the wave's path are carried with it to the other side. Any Huge or smaller vehicles struck by the wave have a 25 percent chance of capsizing.",
			"text | The water level remains elevated until the spell ends or you choose a different effect. If this effect produced a wave, the wave repeats on the start of your next turn while the flood effect lasts.",
			"description | Part Water | You part water in the area and create a trench. The trench extends across the spell's area, and the separated water forms a wall to either side. The trench remains until the spell ends or you choose a different effect. The water then slowly fills in the trench over the course of the next round until the normal water level is restored.",
			"description | Redirect Flow | You cause flowing water in the area to move in a direction you choose, even if the water has to flow over obstacles, up walls, or in other unlikely directions. The water in the area moves as you direct it, but once it moves beyond the spell's area, it resumes its flow based on the terrain. The water continues to move in the direction you chose until the spell ends or you choose a different effect.",
			"description | Whirlpool | You cause a whirlpool to form in the center of the area, which must be at least 50 feet square and 25 feet deep. The whirlpool lasts until you choose a different effect or the spell ends. The whirlpool is 5 feet wide at the base, up to 50 feet wide at the top, and 25 feet tall. Any creature in the water and within 25 feet of the whirlpool is pulled 10 feet toward it. When a creature enters the whirlpool for the first time on a turn or ends its turn there, it makes a Strength saving throw. On a failed save, the creature takes 2d8 Bludgeoning damage. On a successful save, the creature takes half as much damage. A creature can swim away from the whirlpool only if it first takes an action to pull away and succeeds on a Strength (Athletics) check against your spell save DC."
		],
		"tags": [
			"spell",
			"PHB'24",
			"4th level",
			"Transmutation",
			"Cleric",
			"Druid",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Control Weather",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 8 Transmutation",
			"rule",
			"property | Casting Time | 10 minutes",
			"property | Range | Self",
			"property | Components | V, S, M (burning incense)",
			"property | Duration | Concentration, up to 8 hours",
			"rule",
			"text | You take control of the weather within 5 miles of you for the duration. You must be outdoors to cast this spell, and it ends early if you go indoors.",
			"text | When you cast the spell, you change the current weather conditions, which are determined by the DM. You can change precipitation, temperature, and wind. It takes 1d4 × 10 minutes for the new conditions to take effect. Once they do so, you can change the conditions again. When the spell ends, the weather gradually returns to normal.",
			"text | When you change the weather conditions, find a current condition on the following tables and change its stage by one, up or down. When changing the wind, you can change its direction.",
			"text | <b>Precipitation</b>",
			"text | Stage｜Condition",
			"text | 1｜Clear",
			"text | 2｜Light clouds",
			"text | 3｜Overcast or ground fog",
			"text | 4｜Rain, hail, or snow",
			"text | 5｜Torrential rain, driving hail, or blizzard",
			"text | <b>Temperature</b>",
			"text | Stage｜Condition",
			"text | 1｜Heat wave",
			"text | 2｜Hot",
			"text | 3｜Warm",
			"text | 4｜Cool",
			"text | 5｜Cold",
			"text | 6｜Freezing",
			"text | <b>Wind</b>",
			"text | Stage｜Condition",
			"text | 1｜Calm",
			"text | 2｜Moderate wind",
			"text | 3｜Strong wind",
			"text | 4｜Gale",
			"text | 5｜Storm"
		],
		"tags": [
			"spell",
			"PHB'24",
			"8th level",
			"Transmutation",
			"Cleric",
			"Druid",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Control Winds",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 5 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 300 feet",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 1 hour",
			"rule",
			"text | You take control of the air in a 100-foot cube that you can see within range. Choose one of the following effects when you cast the spell. The effect lasts for the spell's duration, unless you use your action on a later turn to switch to a different effect. You can also use your action to temporarily halt the effect or to restart one you've halted.",
			"description | Gusts | A wind picks up within the cube, continually blowing in a horizontal direction you designate. You choose the intensity of the wind: calm, moderate, or strong. If the wind is moderate or strong, ranged weapon attacks that pass through it or that are made against targets within the cube have disadvantage on their attack rolls. If the wind is strong, any creature moving against the wind must spend 1 extra foot of movement for each foot moved.",
			"description | Downdraft | You cause a sustained blast of strong wind to blow downward from the top of the cube. Ranged weapon attacks that pass through the cube or that are made against targets within it have disadvantage on their attack rolls. A creature must make a Strength saving throw if it flies into the cube for the first time on a turn or starts its turn there flying. On a failed save, the creature is knocked prone.",
			"description | Updraft | You cause a sustained updraft within the cube, rising upward from the cube's bottom side. Creatures that end a fall within the cube take only half damage from the fall. When a creature in the cube makes a vertical jump, the creature can jump up to 10 feet higher than normal."
		],
		"tags": [
			"spell",
			"XGE",
			"5th level",
			"Transmutation",
			"Druid",
			"Sorcerer",
			"Wizard",
			"Druid",
			"Sorcerer",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Create Bonfire",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Conjuration Cantrip",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 60 feet",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | You create a bonfire on ground that you can see within range. Until the spell ends, the magic bonfire fills a 5-foot cube. Any creature in the bonfire's space when you cast the spell must succeed on a Dexterity saving throw or take 1d8 fire damage. A creature must also make the saving throw when it moves into the bonfire's space for the first time on a turn or ends its turn there.",
			"text | The bonfire ignites flammable objects in its area that aren't being worn or carried.",
			"text | The spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8)."
		],
		"tags": [
			"spell",
			"XGE",
			"Cantrips",
			"Conjuration",
			"Druid",
			"Sorcerer",
			"Warlock",
			"Wizard",
			"Artificer",
			"Druid",
			"Sorcerer",
			"Warlock",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Create or Destroy Water",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 1 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 30 feet",
			"property | Components | V, S, M (a mix of water and sand)",
			"property | Duration | Instantaneous",
			"rule",
			"text | You do one of the following:",
			"bullet | <b>Create Water.</b> You create up to 10 gallons of clean water within range in an open container. Alternatively, the water falls as rain in a 30-foot Cube within range, extinguishing exposed flames there.",
			"bullet | <b>Destroy Water.</b> You destroy up to 10 gallons of water in an open container within range. Alternatively, you destroy fog in a 30-foot Cube within range.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | You create or destroy 10 additional gallons of water, or the size of the Cube increases by 5 feet, for each spell slot level above 1."
		],
		"tags": [
			"spell",
			"PHB'24",
			"1st level",
			"Transmutation",
			"Cleric",
			"Druid"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Cure Wounds",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 1 Abjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Touch",
			"property | Components | V, S",
			"property | Duration | Instantaneous",
			"rule",
			"text | A creature you touch regains a number of Hit Points equal to 2d8 plus your spellcasting ability modifier.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The healing increases by 2d8 for each spell slot level above 1."
		],
		"tags": [
			"spell",
			"PHB'24",
			"1st level",
			"Abjuration",
			"Bard",
			"Cleric",
			"Druid",
			"Ranger",
			"Paladin",
			"Artificer"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Darkvision",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Touch",
			"property | Components | V, S, M (a dried carrot)",
			"property | Duration | 8 hours",
			"rule",
			"text | For the duration, a willing creature you touch has Darkvision with a range of 150 feet."
		],
		"tags": [
			"spell",
			"PHB'24",
			"2nd level",
			"Transmutation",
			"Druid",
			"Ranger",
			"Sorcerer",
			"Wizard",
			"Artificer"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Daylight",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 3 Evocation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 60 feet",
			"property | Components | V, S",
			"property | Duration | 1 hour",
			"rule",
			"text | For the duration, sunlight spreads from a point within range and fills a 60-foot-radius Sphere. The sunlight's area is Bright Light and sheds Dim Light for an additional 60 feet.",
			"text | Alternatively, you cast the spell on an object that isn't being worn or carried, causing the sunlight to fill a 60-foot Emanation originating from that object. Covering that object with something opaque, such as a bowl or helm, blocks the sunlight.",
			"text | If any of this spell's area overlaps with an area of Darkness created by a spell of level 3 or lower, that other spell is dispelled."
		],
		"tags": [
			"spell",
			"PHB'24",
			"3rd level",
			"Evocation",
			"Cleric",
			"Druid",
			"Ranger",
			"Sorcerer",
			"Paladin"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Detect Magic",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 1 Divination",
			"rule",
			"property | Casting Time | Action or Ritual",
			"property | Range | Self",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | For the duration, you sense the presence of magical effects within 30 feet of yourself. If you sense such effects, you can take the Magic action to see a faint aura around any visible creature or object in the area that bears the magic, and if an effect was created by a spell, you learn the spell's school of magic.",
			"text | The spell is blocked by 1 foot of stone, dirt, or wood; 1 inch of metal; or a thin sheet of lead."
		],
		"tags": [
			"spell",
			"PHB'24",
			"1st level",
			"Divination",
			"Bard",
			"Cleric",
			"Druid",
			"Ranger",
			"Sorcerer",
			"Warlock",
			"Wizard",
			"Paladin",
			"Artificer",
			"concentration",
			"ritual"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Detect Poison and Disease",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 1 Divination",
			"rule",
			"property | Casting Time | Action or Ritual",
			"property | Range | Self",
			"property | Components | V, S, M (a yew leaf)",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | For the duration, you sense the location of poisons, poisonous or venomous creatures, and magical contagions within 30 feet of yourself. You sense the kind of poison, creature, or contagion in each case.",
			"text | The spell is blocked by 1 foot of stone, dirt, or wood; 1 inch of metal; or a thin sheet of lead."
		],
		"tags": [
			"spell",
			"PHB'24",
			"1st level",
			"Divination",
			"Cleric",
			"Druid",
			"Ranger",
			"Paladin",
			"concentration",
			"ritual"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Dispel Magic",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 3 Abjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 120 feet",
			"property | Components | V, S",
			"property | Duration | Instantaneous",
			"rule",
			"text | Choose one creature, object, or magical effect within range. Any ongoing spell of level 3 or lower on the target ends. For each ongoing spell of level 4 or higher on the target, make an ability check using your spellcasting ability (DC 10 plus that spell's level). On a successful check, the spell ends.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | You automatically end a spell on the target if the spell's level is equal to or less than the level of the spell slot you use."
		],
		"tags": [
			"spell",
			"PHB'24",
			"3rd level",
			"Abjuration",
			"Bard",
			"Cleric",
			"Druid",
			"Ranger",
			"Sorcerer",
			"Warlock",
			"Wizard",
			"Paladin",
			"Artificer"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Divination",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 4 Divination",
			"rule",
			"property | Casting Time | Action or Ritual",
			"property | Range | Self",
			"property | Components | V, S, M (incense worth 25+ GP, which the spell consumes)",
			"property | Duration | Instantaneous",
			"rule",
			"text | This spell puts you in contact with a god or a god's servants. You ask one question about a specific goal, event, or activity to occur within 7 days. The DM offers a truthful reply, which might be a short phrase or cryptic rhyme. The spell doesn't account for circumstances that might change the answer, such as the casting of other spells.",
			"text | If you cast the spell more than once before finishing a Long Rest, there is a cumulative 25 percent chance for each casting after the first that you get no answer."
		],
		"tags": [
			"spell",
			"PHB'24",
			"4th level",
			"Divination",
			"Cleric",
			"Druid",
			"Wizard",
			"ritual"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Dominate Beast",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 4 Enchantment",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 60 feet",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | One Beast you can see within range must succeed on a Wisdom saving throw or have the Charmed condition for the duration. The target has Advantage on the save if you or your allies are fighting it. Whenever the target takes damage, it repeats the save, ending the spell on itself on a success.",
			"text | You have a telepathic link with the Charmed target while the two of you are on the same plane of existence. On your turn, you can use this link to issue commands to the target (no action required), such as \"Attack that creature,\" \"Move over there,\" or \"Fetch that object.\" The target does its best to obey on its turn. If it completes an order and doesn't receive further direction from you, it acts and moves as it likes, focusing on protecting itself.",
			"text | You can command the target to take a Reaction but must take your own Reaction to do so.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | Your Concentration can last longer with a spell slot of level 5 (up to 10 minutes), 6 (up to 1 hour), or 7+ (up to 8 hours)."
		],
		"tags": [
			"spell",
			"PHB'24",
			"4th level",
			"Enchantment",
			"Druid",
			"Ranger",
			"Sorcerer",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Draconic Transformation",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 7 Transmutation",
			"rule",
			"property | Casting Time | Bonus action",
			"property | Range | Self",
			"property | Components | V, S, M (a statuette of a dragon, worth at least 500 gp)",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | With a roar, you draw on the magic of dragons to transform yourself, taking on draconic features. You gain the following benefits until the spell ends:",
			"bullet | <b>Blindsight.</b> You have blindsight with a range of 30 feet. Within that range, you can effectively see anything that isn't behind total cover, even if you're blinded or in darkness. Moreover, you can see an invisible creature, unless the creature successfully hides from you.",
			"bullet | <b>Breath Weapon.</b> When you cast this spell, and as a bonus action on subsequent turns for the duration, you can exhale shimmering energy in a 60-foot cone. Each creature in that area must make a Dexterity saving throw, taking 6d8 force damage on a failed save, or half as much damage on a successful one.",
			"bullet | <b>Wings.</b> Incorporeal wings sprout from your back, giving you a flying speed of 60 feet."
		],
		"tags": [
			"spell",
			"FTD",
			"7th level",
			"Transmutation",
			"Druid",
			"Sorcerer",
			"Wizard",
			"Druid",
			"Sorcerer",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Druid Grove",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 6 Abjuration",
			"rule",
			"property | Casting Time | 10 minutes",
			"property | Range | Touch",
			"property | Components | V, S, M (mistletoe, which the spell consumes, that was harvested with a golden sickle under the light of a full moon)",
			"property | Duration | 24 hours",
			"rule",
			"text | You invoke the spirits of nature to protect an area outdoors or underground. The area can be as small as a 30-foot cube or as large as a 90-foot cube. Buildings and other structures are excluded from the affected area. If you cast this spell in the same area every day for a year, the spell lasts until dispelled.",
			"text | The spell creates the following effects within the area. When you cast this spell, you can specify creatures as friends who are immune to the effects. You can also specify a password that, when spoken aloud, makes the speaker immune to these effects.",
			"text | The entire warded area radiates magic. A dispel magic cast on the area, if successful, removes only one of the following effects, not the entire area. That spell's caster chooses which effect to end. Only when all its effects are gone is this spell dispelled.",
			"description | Solid Fog | You can fill any number of 5-foot squares on the ground with thick fog, making them heavily obscured. The fog reaches 10 feet high. In addition, every foot of movement through the fog costs 2 extra feet. To a creature immune to this effect, the fog obscures nothing and looks like soft mist, with motes of green light floating in the air.",
			"description | Grasping Undergrowth | You can fill any number of 5-foot squares on the ground that aren't filled with fog with grasping weeds and vines, as if they were affected by an entangle spell. To a creature immune to this effect, the weeds and vines feel soft and reshape themselves to serve as temporary seats or beds.",
			"description | Grove Guardians | You can animate up to four trees in the area, causing them to uproot themselves from the ground. These trees have the same statistics as an awakened tree, which appears in the Monster Manual, except they can't speak, and their bark is covered with druidic symbols. If any creature not immune to this effect enters the warded area, the grove guardians fight until they have driven off or slain the intruders. The grove guardians also obey your spoken commands (no action required by you) that you issue while in the area. If you don't give them commands and no intruders are present, the grove guardians do nothing. The grove guardians can't leave the warded area. When the spell ends, the magic animating them disappears, and the trees take root again if possible.",
			"description | Additional Spell Effect | You can place your choice of one of the following magical effects within the warded area:",
			"bullet | A constant gust of wind in two locations of your choice",
			"bullet | Spike growth in one location of your choice",
			"bullet | Wind wall in two locations of your choice",
			"text | To a creature immune to this effect, the winds are a fragrant, gentle breeze, and the area of spike growth is harmless."
		],
		"tags": [
			"spell",
			"XGE",
			"6th level",
			"Abjuration",
			"Druid",
			"Druid"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Druidcraft",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Transmutation Cantrip",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 30 feet",
			"property | Components | V, S",
			"property | Duration | Instantaneous",
			"rule",
			"text | Whispering to the spirits of nature, you create one of the following effects within range.",
			"description | Weather Sensor | You create a Tiny, harmless sensory effect that predicts what the weather will be at your location for the next 24 hours. The effect might manifest as a golden orb for clear skies, a cloud for rain, falling snowflakes for snow, and so on. This effect persists for 1 round.",
			"description | Bloom | You instantly make a flower blossom, a seed pod open, or a leaf bud bloom.",
			"description | Sensory Effect | You create a harmless sensory effect, such as falling leaves, spectral dancing fairies, a gentle breeze, the sound of an animal, or the faint odor of skunk. The effect must fit in a 5-foot Cube.",
			"description | Fire Play | You light or snuff out a candle, a torch, or a campfire."
		],
		"tags": [
			"spell",
			"PHB'24",
			"Cantrips",
			"Transmutation",
			"Druid"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Dust Devil",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 60 feet",
			"property | Components | V, S, M (a pinch of dust)",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | Choose an unoccupied 5-foot cube of air that you can see within range. An elemental force that resembles a dust devil appears in the cube and lasts for the spell's duration.",
			"text | Any creature that ends its turn within 5 feet of the dust devil must make a Strength saving throw. On a failed save, the creature takes 1d8 bludgeoning damage and is pushed 10 feet away from the dust devil. On a successful save, the creature takes half as much damage and isn't pushed.",
			"text | As a bonus action, you can move the dust devil up to 30 feet in any direction. If the dust devil moves over sand, dust, loose dirt, or light gravel, it sucks up the material and forms a 10-foot-radius cloud of debris around itself that lasts until the start of your next turn. The cloud heavily obscures its area.",
			"section | At higher levels",
			"text | When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd."
		],
		"tags": [
			"spell",
			"XGE",
			"2nd level",
			"Conjuration",
			"Druid",
			"Sorcerer",
			"Wizard",
			"Druid",
			"Sorcerer",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Earth Tremor",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 1 Evocation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 10 feet",
			"property | Components | V, S",
			"property | Duration | Instantaneous",
			"rule",
			"text | You cause a tremor in the ground within range. Each creature other than you in that area must make a Dexterity saving throw. On a failed save, a creature takes 1d6 bludgeoning damage and is knocked prone. If the ground in that area is loose earth or stone, it becomes difficult terrain until cleared, with each 5-foot-diameter portion requiring at least 1 minute to clear by hand.",
			"section | At higher levels",
			"text | When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st."
		],
		"tags": [
			"spell",
			"XGE",
			"1st level",
			"Evocation",
			"Bard",
			"Druid",
			"Sorcerer",
			"Wizard",
			"Bard",
			"Druid",
			"Sorcerer",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Earthbind",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 300 feet",
			"property | Components | V",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | Choose one creature you can see within range. Yellow strips of magical energy loop around the creature. The target must succeed on a Strength saving throw, or its flying speed (if any) is reduced to 0 feet for the spell's duration. An airborne creature affected by this spell safely descends at 60 feet per round until it reaches the ground or the spell ends."
		],
		"tags": [
			"spell",
			"XGE",
			"2nd level",
			"Transmutation",
			"Druid",
			"Sorcerer",
			"Warlock",
			"Wizard",
			"Druid",
			"Sorcerer",
			"Warlock",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Earthquake",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 8 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 500 feet",
			"property | Components | V, S, M (a fractured rock)",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | Choose a point on the ground that you can see within range. For the duration, an intense tremor rips through the ground in a 100-foot-radius circle centered on that point. The ground there is Difficult Terrain.",
			"text | When you cast this spell and at the end of each of your turns for the duration, each creature on the ground in the area makes a Dexterity saving throw. On a failed save, a creature has the Prone condition, and its Concentration is broken.",
			"text | You can also cause the effects below.",
			"description | Fissures | A total of 1d6 fissures open in the spell's area at the end of the turn you cast it. You choose the fissures' locations, which can't be under structures. Each fissure is 1d10 × 10 feet deep and 10 feet wide, and it extends from one edge of the spell's area to another edge. A creature in the same space as a fissure must succeed on a Dexterity saving throw or fall in. A creature that successfully saves moves with the fissure's edge as it opens.",
			"description | Structures | The tremor deals 50 Bludgeoning damage to any structure in contact with the ground in the area when you cast the spell and at the end of each of your turns until the spell ends. If a structure drops to 0 Hit Points, it collapses.",
			"text | A creature within a distance from a collapsing structure equal to half the structure's height makes a Dexterity saving throw. On a failed save, the creature takes 12d6 Bludgeoning damage, has the Prone condition, and is buried in the rubble, requiring a DC 20 Strength (Athletics) check as an action to escape. On a successful save, the creature takes half as much damage only."
		],
		"tags": [
			"spell",
			"PHB'24",
			"8th level",
			"Transmutation",
			"Cleric",
			"Druid",
			"Sorcerer",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Elemental Bane",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 4 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 90 feet",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | Choose one creature you can see within range, and choose one of the following damage types: acid, cold, fire, lightning, or thunder. The target must succeed on a Constitution saving throw or be affected by the spell for its duration. The first time each turn the affected target takes damage of the chosen type, the target takes an extra 2d6 damage of that type. Moreover, the target loses any resistance to that damage type until the spell ends.",
			"section | At higher levels",
			"text | When you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each slot level above 4th. The creatures must be within 30 feet of each other when you target them."
		],
		"tags": [
			"spell",
			"XGE",
			"4th level",
			"Transmutation",
			"Druid",
			"Warlock",
			"Wizard",
			"Artificer",
			"Druid",
			"Warlock",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Elemental Weapon",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 3 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Touch",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 1 hour",
			"rule",
			"text | A nonmagical weapon you touch becomes a magic weapon. Choose one of the following damage types: Acid, Cold, Fire, Lightning, or Thunder. For the duration, the weapon has a +1 bonus to attack rolls and deals an extra 1d4 damage of the chosen type when it hits.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | If you use a level 5-6 spell slot, the bonus to attack rolls increases to +2, and the extra damage increases to 2d4. If you use a level 7+ spell slot, the bonus increases to +3, and the extra damage increases to 3d4."
		],
		"tags": [
			"spell",
			"PHB'24",
			"3rd level",
			"Transmutation",
			"Druid",
			"Ranger",
			"Paladin",
			"Artificer",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Elementalism",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Transmutation Cantrip",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 30 feet",
			"property | Components | V, S",
			"property | Duration | Instantaneous",
			"rule",
			"text | You exert control over the elements, creating one of the following effects within range.",
			"description | Beckon Air | You create a breeze strong enough to ripple cloth, stir dust, rustle leaves, and close open doors and shutters, all in a 5-foot Cube. Doors and shutters being held open by someone or something aren't affected.",
			"description | Beckon Earth | You create a thin shroud of dust or sand that covers surfaces in a 5-foot-square area, or you cause a single word to appear in your handwriting in a patch of dirt or sand.",
			"description | Beckon Fire | You create a thin cloud of harmless embers and colored, scented smoke in a 5-foot Cube. You choose the color and scent, and the embers can light candles, torches, or lamps in that area. The smoke's scent lingers for 1 minute.",
			"description | Beckon Water | You create a spray of cool mist that lightly dampens creatures and objects in a 5-foot Cube. Alternatively, you create 1 cup of clean water either in an open container or on a surface, and the water evaporates in 1 minute.",
			"description | Sculpt Element | You cause dirt, sand, fire, smoke, mist, or water that can fit in a 1-foot Cube to assume a crude shape (such as that of a creature) for 1 hour."
		],
		"tags": [
			"spell",
			"PHB'24",
			"Cantrips",
			"Transmutation",
			"Druid",
			"Sorcerer",
			"Wizard",
			"Artificer"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Elminster's Effulgent Spheres",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 6 Evocation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V, S, M (an opal worth 1,000 GP+)",
			"property | Duration | 1 hour",
			"rule",
			"text | Six chromatic spheres orbit you for the duration.",
			"text | While the spheres are present, you can expend spheres to create the following effects:",
			"bullet | <b>Absorb Energy.</b> When you take Acid, Cold, Fire, Lightning, or Thunder damage, you can take a Reaction to expend one sphere and give yourself Resistance to the triggering damage type until the start of your next turn.",
			"bullet | <b>Energy Blast.</b> As a Bonus Action, you send one sphere hurtling toward a target within 120 feet of yourself. Make a ranged spell attack. On a hit, the target takes 3d6 Acid, Cold, Fire, Lightning, or Thunder damage (your choice). Regardless of whether you hit, the sphere is expended.",
			"text | The spell ends early if you have no more spheres remaining.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The number of spheres increases by 1 for every spell slot level above 6."
		],
		"tags": [
			"spell",
			"FRHoF",
			"6th level",
			"Evocation",
			"Druid",
			"Sorcerer",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Enhance Ability",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Touch",
			"property | Components | V, S, M (fur or a feather)",
			"property | Duration | Concentration, up to 1 hour",
			"rule",
			"text | You touch a creature and choose Strength, Dexterity, Intelligence, Wisdom, or Charisma. For the duration, the target has Advantage on ability checks using the chosen ability.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | You can target one additional creature for each spell slot level above 2. You can choose a different ability for each target."
		],
		"tags": [
			"spell",
			"PHB'24",
			"2nd level",
			"Transmutation",
			"Bard",
			"Cleric",
			"Druid",
			"Ranger",
			"Sorcerer",
			"Wizard",
			"Artificer",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Enlarge/Reduce",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 30 feet",
			"property | Components | V, S, M (a pinch of powdered iron)",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | For the duration, the spell enlarges or reduces a creature or an object you can see within range (see the chosen effect below). A targeted object must be neither worn nor carried. If the target is an unwilling creature, it can make a Constitution saving throw. On a successful save, the spell has no effect.",
			"text | Everything that a targeted creature is wearing and carrying changes size with it. Any item it drops returns to normal size at once. A thrown weapon or piece of ammunition returns to normal size immediately after it hits or misses a target.",
			"description | Enlarge | The target's size increases by one category—from Medium to Large, for example. The target also has Advantage on Strength checks and Strength saving throws. The target's attacks with its enlarged weapons or Unarmed Strikes deal an extra 1d4 damage on a hit.",
			"description | Reduce | The target's size decreases by one category—from Medium to Small, for example. The target also has Disadvantage on Strength checks and Strength saving throws. The target's attacks with its reduced weapons or Unarmed Strikes deal 1d4 less damage on a hit (this can't reduce the damage below 1)."
		],
		"tags": [
			"spell",
			"PHB'24",
			"2nd level",
			"Transmutation",
			"Bard",
			"Druid",
			"Sorcerer",
			"Wizard",
			"Artificer",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Entangle",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 1 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 90 feet",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | Grasping plants sprout from the ground in a 20-foot square within range. For the duration, these plants turn the ground in the area into Difficult Terrain. They disappear when the spell ends.",
			"text | Each creature (other than you) in the area when you cast the spell must succeed on a Strength saving throw or have the Restrained condition until the spell ends. A Restrained creature can take an action to make a Strength (Athletics) check against your spell save DC. On a success, it frees itself from the grasping plants and is no longer Restrained by them."
		],
		"tags": [
			"spell",
			"PHB'24",
			"1st level",
			"Conjuration",
			"Druid",
			"Ranger",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Erupting Earth",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 3 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 120 feet",
			"property | Components | V, S, M (a piece of obsidian)",
			"property | Duration | Instantaneous",
			"rule",
			"text | Choose a point you can see on the ground within range. A fountain of churned earth and stone erupts in a 20-foot cube centered on that point. Each creature in that area must make a Dexterity saving throw. A creature takes 3d12 bludgeoning damage on a failed save, or half as much damage on a successful one. Additionally, the ground in that area becomes difficult terrain until cleared. Each 5-foot-square portion of the area requires at least 1 minute to clear by hand.",
			"section | At higher levels",
			"text | When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d12 for each slot level above 3rd."
		],
		"tags": [
			"spell",
			"XGE",
			"3rd level",
			"Transmutation",
			"Druid",
			"Sorcerer",
			"Wizard",
			"Druid",
			"Sorcerer",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Faerie Fire",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 1 Evocation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 60 feet",
			"property | Components | V",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | Objects in a 20-foot Cube within range are outlined in blue, green, or violet light (your choice). Each creature in the Cube is also outlined if it fails a Dexterity saving throw. For the duration, objects and affected creatures shed Dim Light in a 10-foot radius and can't benefit from the Invisible condition.",
			"text | Attack rolls against an affected creature or object have Advantage if the attacker can see it."
		],
		"tags": [
			"spell",
			"PHB'24",
			"1st level",
			"Evocation",
			"Bard",
			"Druid",
			"Artificer",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Feign Death",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 3 Necromancy",
			"rule",
			"property | Casting Time | Action or Ritual",
			"property | Range | Touch",
			"property | Components | V, S, M (a pinch of graveyard dirt)",
			"property | Duration | 1 hour",
			"rule",
			"text | You touch a willing creature and put it into a cataleptic state that is indistinguishable from death.",
			"text | For the duration, the target appears dead to outward inspection and to spells used to determine the target's status. The target has the Blinded and Incapacitated conditions, and its Speed is 0.",
			"text | The target also has Resistance to all damage except Psychic damage, and it has Immunity to the Poisoned condition."
		],
		"tags": [
			"spell",
			"PHB'24",
			"3rd level",
			"Necromancy",
			"Bard",
			"Cleric",
			"Druid",
			"Wizard",
			"ritual"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Find the Path",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 6 Divination",
			"rule",
			"property | Casting Time | 1 minute",
			"property | Range | Self",
			"property | Components | V, S, M (a set of divination tools—such as cards or runes—worth 100+ GP)",
			"property | Duration | Concentration, up to 1 day",
			"rule",
			"text | You magically sense the most direct physical route to a location you name. You must be familiar with the location, and the spell fails if you name a destination on another plane of existence, a moving destination (such as a mobile fortress), or an unspecific destination (such as \"a green dragon's lair\").",
			"text | For the duration, as long as you are on the same plane of existence as the destination, you know how far it is and in what direction it lies. Whenever you face a choice of paths along the way there, you know which path is the most direct."
		],
		"tags": [
			"spell",
			"PHB'24",
			"6th level",
			"Divination",
			"Bard",
			"Cleric",
			"Druid",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Find Traps",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Divination",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 120 feet",
			"property | Components | V, S",
			"property | Duration | Instantaneous",
			"rule",
			"text | You sense any trap within range that is within line of sight. A trap, for the purpose of this spell, includes any object or mechanism that was created to cause damage or other danger. Thus, the spell would sense the Alarm or Glyph of Warding spell or a mechanical pit trap, but it wouldn't reveal a natural weakness in the floor, an unstable ceiling, or a hidden sinkhole.",
			"text | This spell reveals that a trap is present but not its location. You do learn the general nature of the danger posed by a trap you sense."
		],
		"tags": [
			"spell",
			"PHB'24",
			"2nd level",
			"Divination",
			"Cleric",
			"Druid",
			"Ranger"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Fire Shield",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 4 Evocation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V, S, M (a bit of phosphorus or a firefly)",
			"property | Duration | 10 minutes",
			"rule",
			"text | Wispy flames wreathe your body for the duration, shedding Bright Light in a 10-foot radius and Dim Light for an additional 10 feet.",
			"text | The flames provide you with a warm shield or a chill shield, as you choose. The warm shield grants you Resistance to Cold damage, and the chill shield grants you Resistance to Fire damage.",
			"text | In addition, whenever a creature within 5 feet of you hits you with a melee attack roll, the shield erupts with flame. The attacker takes 2d8 Fire damage from a warm shield or 2d8 Cold damage from a chill shield."
		],
		"tags": [
			"spell",
			"PHB'24",
			"4th level",
			"Evocation",
			"Druid",
			"Sorcerer",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Fire Storm",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 7 Evocation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 150 feet",
			"property | Components | V, S",
			"property | Duration | Instantaneous",
			"rule",
			"text | A storm of fire appears within range. The area of the storm consists of up to ten 10-foot Cubes, which you arrange as you like. Each Cube must be contiguous with at least one other Cube. Each creature in the area makes a Dexterity saving throw, taking 7d10 Fire damage on a failed save or half as much damage on a successful one.",
			"text | Flammable objects in the area that aren't being worn or carried start burning."
		],
		"tags": [
			"spell",
			"PHB'24",
			"7th level",
			"Evocation",
			"Cleric",
			"Druid",
			"Sorcerer"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Flame Arrows",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 3 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Touch",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 1 hour",
			"rule",
			"text | You touch a quiver containing arrows or bolts. When a target is hit by a ranged weapon attack using a piece of ammunition drawn from the quiver, the target takes an extra 1d6 fire damage. The spell's magic ends on a piece of ammunition when it hits or misses, and the spell ends when twelve pieces of ammunition have been drawn from the quiver.",
			"section | At higher levels",
			"text | When you cast this spell using a spell slot of 4th level or higher, the number of pieces of ammunition you can affect with this spell increases by two for each slot level above 3rd."
		],
		"tags": [
			"spell",
			"XGE",
			"3rd level",
			"Transmutation",
			"Druid",
			"Ranger",
			"Sorcerer",
			"Wizard",
			"Artificer",
			"Druid",
			"Ranger",
			"Sorcerer",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Flame Blade",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Evocation",
			"rule",
			"property | Casting Time | Bonus action",
			"property | Range | Self",
			"property | Components | V, S, M (a sumac leaf)",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | You evoke a fiery blade in your free hand. The blade is similar in size and shape to a scimitar, and it lasts for the duration. If you let go of the blade, it disappears, but you can evoke it again as a Bonus Action.",
			"text | As a Magic action, you can make a melee spell attack with the fiery blade. On a hit, the target takes Fire damage equal to 3d6 plus your spellcasting ability modifier.",
			"text | The flaming blade sheds Bright Light in a 10-foot radius and Dim Light for an additional 10 feet.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The damage increases by 1d6 for each spell slot level above 2."
		],
		"tags": [
			"spell",
			"PHB'24",
			"2nd level",
			"Evocation",
			"Druid",
			"Sorcerer",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Flaming Sphere",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 60 feet",
			"property | Components | V, S, M (a ball of wax)",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | You create a 5-foot-diameter sphere of fire in an unoccupied space on the ground within range. It lasts for the duration. Any creature that ends its turn within 5 feet of the sphere makes a Dexterity saving throw, taking 2d6 Fire damage on a failed save or half as much damage on a successful one.",
			"text | As a Bonus Action, you can move the sphere up to 30 feet, rolling it along the ground. If you move the sphere into a creature's space, that creature makes the save against the sphere, and the sphere stops moving for the turn.",
			"text | When you move the sphere, you can direct it over barriers up to 5 feet tall and jump it across pits up to 10 feet wide. Flammable objects that aren't being worn or carried start burning if touched by the sphere, and it sheds Bright Light in a 20-foot radius and Dim Light for an additional 20 feet.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The damage increases by 1d6 for each spell slot level above 2."
		],
		"tags": [
			"spell",
			"PHB'24",
			"2nd level",
			"Conjuration",
			"Druid",
			"Sorcerer",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Flesh to Stone",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 6 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 60 feet",
			"property | Components | V, S, M (a cockatrice feather)",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | You attempt to turn one creature that you can see within range into stone. The target makes a Constitution saving throw. On a failed save, it has the Restrained condition for the duration. On a successful save, its Speed is 0 until the start of your next turn. Constructs automatically succeed on the save.",
			"text | A Restrained target makes another Constitution saving throw at the end of each of its turns. If it successfully saves against this spell three times, the spell ends. If it fails its saves three times, it is turned to stone and has the Petrified condition for the duration. The successes and failures needn't be consecutive; keep track of both until the target collects three of a kind.",
			"text | If you maintain your Concentration on this spell for the entire possible duration, the target is Petrified until the condition is ended by Greater Restoration or similar magic."
		],
		"tags": [
			"spell",
			"PHB'24",
			"6th level",
			"Transmutation",
			"Druid",
			"Sorcerer",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Fog Cloud",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 1 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 120 feet",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 1 hour",
			"rule",
			"text | You create a 20-foot-radius Sphere of fog centered on a point within range. The Sphere is Heavily Obscured. It lasts for the duration or until a strong wind (such as one created by Gust of Wind) disperses it.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The fog's radius increases by 20 feet for each spell slot level above 1."
		],
		"tags": [
			"spell",
			"PHB'24",
			"1st level",
			"Conjuration",
			"Druid",
			"Ranger",
			"Sorcerer",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Foresight",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 9 Divination",
			"rule",
			"property | Casting Time | 1 minute",
			"property | Range | Touch",
			"property | Components | V, S, M (a hummingbird feather)",
			"property | Duration | 8 hours",
			"rule",
			"text | You touch a willing creature and bestow a limited ability to see into the immediate future. For the duration, the target has Advantage on D20 Tests, and other creatures have Disadvantage on attack rolls against it. The spell ends early if you cast it again."
		],
		"tags": [
			"spell",
			"PHB'24",
			"9th level",
			"Divination",
			"Bard",
			"Druid",
			"Warlock",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Fount of Moonlight",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 4 Evocation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | A cool light wreathes your body for the duration, emitting Bright Light in a 20-foot radius and Dim Light for an additional 20 feet.",
			"text | Until the spell ends, you have Resistance to Radiant damage, and your melee attacks deal an extra 2d6 Radiant damage on a hit.",
			"text | In addition, immediately after you take damage from a creature you can see within 60 feet of yourself, you can take a Reaction to force the creature to make a Constitution saving throw. On a failed save, the creature has the Blinded condition until the end of your next turn."
		],
		"tags": [
			"spell",
			"PHB'24",
			"4th level",
			"Evocation",
			"Bard",
			"Druid",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Freedom of Movement",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 4 Abjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Touch",
			"property | Components | V, S, M (a leather strap)",
			"property | Duration | 1 hour",
			"rule",
			"text | You touch a willing creature. For the duration, the target's movement is unaffected by Difficult Terrain, and spells and other magical effects can neither reduce the target's Speed nor cause the target to have the Paralyzed or Restrained conditions. The target also has a Swim Speed equal to its Speed.",
			"text | In addition, the target can spend 5 feet of movement to automatically escape from nonmagical restraints, such as manacles or a creature imposing the Grappled condition on it.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | You can target one additional creature for each spell slot level above 4."
		],
		"tags": [
			"spell",
			"PHB'24",
			"4th level",
			"Abjuration",
			"Bard",
			"Cleric",
			"Druid",
			"Ranger",
			"Artificer"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Frostbite",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Evocation Cantrip",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 60 feet",
			"property | Components | V, S",
			"property | Duration | Instantaneous",
			"rule",
			"text | You cause numbing frost to form on one creature that you can see within range. The target must make a Constitution saving throw. On a failed save, the target takes 1d6 cold damage, and it has disadvantage on the next weapon attack roll it makes before the end of its next turn.",
			"text | The spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6)."
		],
		"tags": [
			"spell",
			"XGE",
			"Cantrips",
			"Evocation",
			"Druid",
			"Sorcerer",
			"Warlock",
			"Wizard",
			"Artificer",
			"Druid",
			"Sorcerer",
			"Warlock",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Geas",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 5 Enchantment",
			"rule",
			"property | Casting Time | 1 minute",
			"property | Range | 60 feet",
			"property | Components | V",
			"property | Duration | 30 days",
			"rule",
			"text | You give a verbal command to a creature that you can see within range, ordering it to carry out some service or refrain from an action or a course of activity as you decide. The target must succeed on a Wisdom saving throw or have the Charmed condition for the duration. The target automatically succeeds if it can't understand your command.",
			"text | While Charmed, the creature takes 5d10 Psychic damage if it acts in a manner directly counter to your command. It takes this damage no more than once each day.",
			"text | You can issue any command you choose, short of an activity that would result in certain death. Should you issue a suicidal command, the spell ends.",
			"text | A Remove Curse, Greater Restoration, or Wish spell ends this spell.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | If you use a level 7 or 8 spell slot, the duration is 365 days. If you use a level 9 spell slot, the spell lasts until it is ended by one of the spells mentioned above."
		],
		"tags": [
			"spell",
			"PHB'24",
			"5th level",
			"Enchantment",
			"Bard",
			"Cleric",
			"Druid",
			"Wizard",
			"Paladin"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Giant Insect",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 4 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 60 feet",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | You summon a giant centipede, spider, or wasp (chosen when you cast the spell). It manifests in an unoccupied space you can see within range and uses the Giant Insect stat block. The form you choose determines certain details in its stat block. The creature disappears when it drops to 0 Hit Points or when the spell ends.",
			"text | The creature is an ally to you and your allies. In combat, the creature shares your Initiative count, but it takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don't issue any, it takes the Dodge action and uses its movement to avoid danger.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | Use the spell slot's level for the spell's level in the stat block."
		],
		"tags": [
			"spell",
			"PHB'24",
			"4th level",
			"Conjuration",
			"Druid",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Goodberry",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 1 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Touch",
			"property | Components | V, S, M (a sprig of mistletoe)",
			"property | Duration | 24 hours",
			"rule",
			"text | Ten berries appear in your hand and are infused with magic for the duration. A creature can take a Bonus Action to eat one berry. Eating a berry restores 1 Hit Point, and the berry provides enough nourishment to sustain a creature for one day.",
			"text | Uneaten berries disappear when the spell ends."
		],
		"tags": [
			"spell",
			"PHB'24",
			"1st level",
			"Conjuration",
			"Druid",
			"Ranger"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Grasping Vine",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 4 Conjuration",
			"rule",
			"property | Casting Time | Bonus action",
			"property | Range | 60 feet",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | You conjure a vine that sprouts from a surface in an unoccupied space that you can see within range. The vine lasts for the duration.",
			"text | Make a melee spell attack against a creature within 30 feet of the vine. On a hit, the target takes 4d8 Bludgeoning damage and is pulled up to 30 feet toward the vine; if the target is Huge or smaller, it has the Grappled condition (escape DC equal to your spell save DC). The vine can grapple only one creature at a time, and you can cause the vine to release a Grappled creature (no action required).",
			"text | As a Bonus Action on your later turns, you can repeat the attack against a creature within 30 feet of the vine.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The number of creatures the vine can grapple increases by one for each spell slot level above 4."
		],
		"tags": [
			"spell",
			"PHB'24",
			"4th level",
			"Conjuration",
			"Druid",
			"Ranger",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Greater Restoration",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 5 Abjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Touch",
			"property | Components | V, S, M (diamond dust worth 100+ GP, which the spell consumes)",
			"property | Duration | Instantaneous",
			"rule",
			"text | You touch a creature and magically remove one of the following effects from it:",
			"bullet | 1 Exhaustion level",
			"bullet | The Charmed or Petrified condition",
			"bullet | A curse, including the target's Attunement to a cursed magic item",
			"bullet | Any reduction to one of the target's ability scores",
			"bullet | Any reduction to the target's Hit Point maximum"
		],
		"tags": [
			"spell",
			"PHB'24",
			"5th level",
			"Abjuration",
			"Bard",
			"Cleric",
			"Druid",
			"Ranger",
			"Paladin",
			"Artificer"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Guardian of Nature",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 4 Transmutation",
			"rule",
			"property | Casting Time | Bonus action",
			"property | Range | Self",
			"property | Components | V",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | A nature spirit answers your call and transforms you into a powerful guardian. The transformation lasts until the spell ends. You choose one of the following forms to assume: Primal Beast or Great Tree.",
			"description | Primal Beast | Bestial fur covers your body, your facial features become feral, and you gain the following benefits:",
			"bullet | Your walking speed increases by 10 feet.",
			"bullet | You gain darkvision with a range of 120 feet.",
			"bullet | You make Strength-based attack rolls with advantage.",
			"bullet | Your melee weapon attacks deal an extra 1d6 force damage on a hit.",
			"description | Great Tree | Your skin appears barky, leaves sprout from your hair, and you gain the following benefits:",
			"bullet | You gain 10 temporary hit points.",
			"bullet | You make Constitution saving throws with advantage.",
			"bullet | You make Dexterity- and Wisdom-based attack rolls with advantage.",
			"bullet | While you are on the ground, the ground within 15 feet of you is difficult terrain for your enemies."
		],
		"tags": [
			"spell",
			"XGE",
			"4th level",
			"Transmutation",
			"Druid",
			"Ranger",
			"Druid",
			"Ranger",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Guidance",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Divination Cantrip",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Touch",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | You touch a willing creature and choose a skill. Until the spell ends, the creature adds 1d4 to any ability check using the chosen skill."
		],
		"tags": [
			"spell",
			"PHB'24",
			"Cantrips",
			"Divination",
			"Cleric",
			"Druid",
			"Artificer",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Gust",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Transmutation Cantrip",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 30 feet",
			"property | Components | V, S",
			"property | Duration | Instantaneous",
			"rule",
			"text | You seize the air and compel it to create one of the following effects at a point you can see within range:",
			"bullet | One Medium or smaller creature that you choose must succeed on a Strength saving throw or be pushed up to 5 feet away from you.",
			"bullet | You create a small blast of air capable of moving one object that is neither held nor carried and that weighs no more than 5 pounds. The object is pushed up to 10 feet away from you. It isn't pushed with enough force to cause damage.",
			"bullet | You create a harmless sensory effect using air, such as causing leaves to rustle, wind to slam shutters closed, or your clothing to ripple in a breeze."
		],
		"tags": [
			"spell",
			"XGE",
			"Cantrips",
			"Transmutation",
			"Druid",
			"Sorcerer",
			"Wizard",
			"Druid",
			"Sorcerer",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Gust of Wind",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Evocation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V, S, M (a legume seed)",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | A Line of strong wind 60 feet long and 10 feet wide blasts from you in a direction you choose for the duration. Each creature in the Line must succeed on a Strength saving throw or be pushed 15 feet away from you in a direction following the Line. A creature that ends its turn in the Line must make the same save.",
			"text | Any creature in the Line must spend 2 feet of movement for every 1 foot it moves when moving closer to you.",
			"text | The gust disperses gas or vapor, and it extinguishes candles and similar unprotected flames in the area. It causes protected flames, such as those of lanterns, to dance wildly and has a 50 percent chance to extinguish them.",
			"text | As a Bonus Action on your later turns, you can change the direction in which the Line blasts from you."
		],
		"tags": [
			"spell",
			"PHB'24",
			"2nd level",
			"Evocation",
			"Druid",
			"Ranger",
			"Sorcerer",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Hallucinatory Terrain",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 4 Illusion",
			"rule",
			"property | Casting Time | 10 minutes",
			"property | Range | 300 feet",
			"property | Components | V, S, M (a mushroom)",
			"property | Duration | 24 hours",
			"rule",
			"text | You make natural terrain in a 150-foot Cube in range look, sound, and smell like another sort of natural terrain. Thus, open fields or a road can be made to resemble a swamp, hill, crevasse, or some other difficult or impassable terrain. A pond can be made to seem like a grassy meadow, a precipice like a gentle slope, or a rock-strewn gully like a wide and smooth road. Manufactured structures, equipment, and creatures within the area aren't changed.",
			"text | The tactile characteristics of the terrain are unchanged, so creatures entering the area are likely to notice the illusion. If the difference isn't obvious by touch, a creature examining the illusion can take the Study action to make an Intelligence (Investigation) check against your spell save DC to disbelieve it. If a creature discerns that the terrain is illusory, the creature sees a vague image superimposed on the real terrain."
		],
		"tags": [
			"spell",
			"PHB'24",
			"4th level",
			"Illusion",
			"Bard",
			"Druid",
			"Warlock",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Heal",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 6 Abjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 60 feet",
			"property | Components | V, S",
			"property | Duration | Instantaneous",
			"rule",
			"text | Choose a creature that you can see within range. Positive energy washes through the target, restoring 70 Hit Points. This spell also ends the Blinded, Deafened, and Poisoned conditions on the target.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The healing increases by 10 for each spell slot level above 6."
		],
		"tags": [
			"spell",
			"PHB'24",
			"6th level",
			"Abjuration",
			"Cleric",
			"Druid"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Healing Spirit",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Conjuration",
			"rule",
			"property | Casting Time | Bonus action",
			"property | Range | 60 feet",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | You call forth a nature spirit to soothe the wounded. The intangible spirit appears in a space that is a 5-foot cube you can see within range. The spirit looks like a transparent beast or fey (your choice).",
			"text | Until the spell ends, whenever you or a creature you can see moves into the spirit's space for the first time on a turn or starts its turn there, you can cause the spirit to restore 1d6 hit points to that creature (no action required). The spirit can't heal constructs or undead. The spirit can heal a number of times equal to 1 + your spellcasting ability modifier (minimum of twice). After healing that number of times, the spirit disappears.",
			"text | As a bonus action on your turn, you can move the spirit up to 30 feet to a space you can see.",
			"section | At higher levels",
			"text | When you cast this spell using a spell slot of 3rd level or higher, the healing increases by 1d6 for each slot level above 2nd."
		],
		"tags": [
			"spell",
			"XGE",
			"2nd level",
			"Conjuration",
			"Druid",
			"Ranger",
			"Druid",
			"Ranger",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Healing Word",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 1 Abjuration",
			"rule",
			"property | Casting Time | Bonus action",
			"property | Range | 60 feet",
			"property | Components | V",
			"property | Duration | Instantaneous",
			"rule",
			"text | A creature of your choice that you can see within range regains Hit Points equal to 2d4 plus your spellcasting ability modifier.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The healing increases by 2d4 for each spell slot level above 1."
		],
		"tags": [
			"spell",
			"PHB'24",
			"1st level",
			"Abjuration",
			"Bard",
			"Cleric",
			"Druid"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Heat Metal",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 60 feet",
			"property | Components | V, S, M (a piece of iron and a flame)",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | Choose a manufactured metal object, such as a metal weapon or a suit of Heavy or Medium metal armor, that you can see within range. You cause the object to glow red-hot. Any creature in physical contact with the object takes 2d8 Fire damage when you cast the spell. Until the spell ends, you can take a Bonus Action on each of your later turns to deal this damage again if the object is within range.",
			"text | If a creature is holding or wearing the object and takes the damage from it, the creature must succeed on a Constitution saving throw or drop the object if it can. If it doesn't drop the object, it has Disadvantage on attack rolls and ability checks until the start of your next turn.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The damage increases by 1d8 for each spell slot level above 2."
		],
		"tags": [
			"spell",
			"PHB'24",
			"2nd level",
			"Transmutation",
			"Bard",
			"Druid",
			"Artificer",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Heroes' Feast",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 6 Conjuration",
			"rule",
			"property | Casting Time | 10 minutes",
			"property | Range | Self",
			"property | Components | V, S, M (a gem-encrusted bowl worth 1,000+ GP, which the spell consumes)",
			"property | Duration | Instantaneous",
			"rule",
			"text | You conjure a feast that appears on a surface in an unoccupied 10-foot Cube next to you. The feast takes 1 hour to consume and disappears at the end of that time, and the beneficial effects don't set in until this hour is over. Up to twelve creatures can partake of the feast.",
			"text | A creature that partakes gains several benefits, which last for 24 hours. The creature has Resistance to Poison damage, and it has Immunity to the Frightened and Poisoned conditions. Its Hit Point maximum also increases by 2d10, and it gains the same number of Hit Points."
		],
		"tags": [
			"spell",
			"PHB'24",
			"6th level",
			"Conjuration",
			"Bard",
			"Cleric",
			"Druid"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Hold Person",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Enchantment",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 60 feet",
			"property | Components | V, S, M (a straight piece of iron)",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | Choose a Humanoid that you can see within range. The target must succeed on a Wisdom saving throw or have the Paralyzed condition for the duration. At the end of each of its turns, the target repeats the save, ending the spell on itself on a success.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | You can target one additional Humanoid for each spell slot level above 2."
		],
		"tags": [
			"spell",
			"PHB'24",
			"2nd level",
			"Enchantment",
			"Bard",
			"Cleric",
			"Druid",
			"Sorcerer",
			"Warlock",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Ice Knife",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 1 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 60 feet",
			"property | Components | S, M (a drop of water or a piece of ice)",
			"property | Duration | Instantaneous",
			"rule",
			"text | You create a shard of ice and fling it at one creature within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 Piercing damage. Hit or miss, the shard then explodes. The target and each creature within 5 feet of it must succeed on a Dexterity saving throw or take 2d6 Cold damage.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The Cold damage increases by 1d6 for each spell slot level above 1."
		],
		"tags": [
			"spell",
			"PHB'24",
			"1st level",
			"Conjuration",
			"Druid",
			"Sorcerer",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Ice Storm",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 4 Evocation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 300 feet",
			"property | Components | V, S, M (a mitten)",
			"property | Duration | Instantaneous",
			"rule",
			"text | Hail falls in a 20-foot-radius, 40-foot-high Cylinder centered on a point within range. Each creature in the Cylinder makes a Dexterity saving throw. A creature takes 2d10 Bludgeoning damage and 4d6 Cold damage on a failed save or half as much damage on a successful one.",
			"text | Hailstones turn ground in the Cylinder into Difficult Terrain until the end of your next turn.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The Bludgeoning damage increases by 1d10 for each spell slot level above 4."
		],
		"tags": [
			"spell",
			"PHB'24",
			"4th level",
			"Evocation",
			"Druid",
			"Sorcerer",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Incendiary Cloud",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 8 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 150 feet",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | A swirling cloud of embers and smoke fills a 20-foot-radius Sphere centered on a point within range. The cloud's area is Heavily Obscured. It lasts for the duration or until a strong wind (like that created by Gust of Wind) disperses it.",
			"text | When the cloud appears, each creature in it makes a Dexterity saving throw, taking 10d8 Fire damage on a failed save or half as much damage on a successful one. A creature must also make this save when the Sphere moves into its space and when it enters the Sphere or ends its turn there. A creature makes this save only once per turn.",
			"text | The cloud moves 10 feet away from you in a direction you choose at the start of each of your turns."
		],
		"tags": [
			"spell",
			"PHB'24",
			"8th level",
			"Conjuration",
			"Druid",
			"Sorcerer",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Infestation",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Conjuration Cantrip",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 30 feet",
			"property | Components | V, S, M (a living flea)",
			"property | Duration | Instantaneous",
			"rule",
			"text | You cause a cloud of mites, fleas, and other parasites to appear momentarily on one creature you can see within range. The target must succeed on a Constitution saving throw, or it takes 1d6 poison damage and moves 5 feet in a random direction if it can move and its speed is at least 5 feet. Roll a d4 for the direction: 1, north; 2, south; 3, east; or 4, west. This movement doesn't provoke opportunity attacks, and if the direction rolled is blocked, the target doesn't move.",
			"text | The spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6)."
		],
		"tags": [
			"spell",
			"XGE",
			"Cantrips",
			"Conjuration",
			"Druid",
			"Sorcerer",
			"Warlock",
			"Wizard",
			"Druid",
			"Sorcerer",
			"Warlock",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Insect Plague",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 5 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 300 feet",
			"property | Components | V, S, M (a locust)",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | Swarming locusts fill a 20-foot-radius Sphere centered on a point you choose within range. The Sphere remains for the duration, and its area is Lightly Obscured and Difficult Terrain.",
			"text | When the swarm appears, each creature in it makes a Constitution saving throw, taking 4d10 Piercing damage on a failed save or half as much damage on a successful one. A creature also makes this save when it enters the spell's area for the first time on a turn or ends its turn there. A creature makes this save only once per turn.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The damage increases by 1d10 for each spell slot level above 5."
		],
		"tags": [
			"spell",
			"PHB'24",
			"5th level",
			"Conjuration",
			"Cleric",
			"Druid",
			"Sorcerer",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Investiture of Flame",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 6 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | Flames race across your body, shedding bright light in a 30-foot radius and dim light for an additional 30 feet for the spell's duration. The flames don't harm you. Until the spell ends, you gain the following benefits:",
			"bullet | You are immune to fire damage and have resistance to cold damage.",
			"bullet | Any creature that moves within 5 feet of you for the first time on a turn or ends its turn there takes 1d10 fire damage.",
			"bullet | You can use your action to create a line of fire 15 feet long and 5 feet wide extending from you in a direction you choose. Each creature in the line must make a Dexterity saving throw. A creature takes 4d8 fire damage on a failed save, or half as much damage on a successful one."
		],
		"tags": [
			"spell",
			"XGE",
			"6th level",
			"Transmutation",
			"Druid",
			"Sorcerer",
			"Warlock",
			"Wizard",
			"Druid",
			"Sorcerer",
			"Warlock",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Investiture of Ice",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 6 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | Until the spell ends, ice rimes your body, and you gain the following benefits:",
			"bullet | You are immune to cold damage and have resistance to fire damage.",
			"bullet | You can move across difficult terrain created by ice or snow without spending extra movement.",
			"bullet | The ground in a 10-foot radius around you is icy and is difficult terrain for creatures other than you. The radius moves with you.",
			"bullet | You can use your action to create a 15-foot cone of freezing wind extending from your outstretched hand in a direction you choose. Each creature in the cone must make a Constitution saving throw. A creature takes 4d6 cold damage on a failed save, or half as much damage on a successful one. A creature that fails its save against this effect has its speed halved until the start of your next turn."
		],
		"tags": [
			"spell",
			"XGE",
			"6th level",
			"Transmutation",
			"Druid",
			"Sorcerer",
			"Warlock",
			"Wizard",
			"Druid",
			"Sorcerer",
			"Warlock",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Investiture of Stone",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 6 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | Until the spell ends, bits of rock spread across your body, and you gain the following benefits:",
			"bullet | You have resistance to bludgeoning, piercing, and slashing damage from nonmagical attacks.",
			"bullet | You can use your action to create a small earthquake on the ground in a 15-foot radius centered on you. Other creatures on that ground must succeed on a Dexterity saving throw or be knocked prone.",
			"bullet | You can move across difficult terrain made of earth or stone without spending extra movement. You can move through solid earth or stone as if it was air and without destabilizing it, but you can't end your movement there. If you do so, you are ejected to the nearest unoccupied space, this spell ends, and you are stunned until the end of your next turn."
		],
		"tags": [
			"spell",
			"XGE",
			"6th level",
			"Transmutation",
			"Druid",
			"Sorcerer",
			"Warlock",
			"Wizard",
			"Druid",
			"Sorcerer",
			"Warlock",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Investiture of Wind",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 6 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | Until the spell ends, wind whirls around you, and you gain the following benefits:",
			"bullet | Ranged weapon attacks made against you have disadvantage on the attack roll.",
			"bullet | You gain a flying speed of 60 feet. If you are still flying when the spell ends, you fall, unless you can somehow prevent it.",
			"bullet | You can use your action to create a 15-foot cube of swirling wind centered on a point you can see within 60 feet of you. Each creature in that area must make a Constitution saving throw. A creature takes 2d10 bludgeoning damage on a failed save, or half as much damage on a successful one. If a Large or smaller creature fails the save, that creature is also pushed up to 10 feet away from the center of the cube."
		],
		"tags": [
			"spell",
			"XGE",
			"6th level",
			"Transmutation",
			"Druid",
			"Sorcerer",
			"Warlock",
			"Wizard",
			"Druid",
			"Sorcerer",
			"Warlock",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Jump",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 1 Transmutation",
			"rule",
			"property | Casting Time | Bonus action",
			"property | Range | Touch",
			"property | Components | V, S, M (a grasshopper's hind leg)",
			"property | Duration | 1 minute",
			"rule",
			"text | You touch a willing creature. Once on each of its turns until the spell ends, that creature can jump up to 30 feet by spending 10 feet of movement.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | You can target one additional creature for each spell slot level above 1."
		],
		"tags": [
			"spell",
			"PHB'24",
			"1st level",
			"Transmutation",
			"Druid",
			"Ranger",
			"Sorcerer",
			"Wizard",
			"Artificer"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Lesser Restoration",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Abjuration",
			"rule",
			"property | Casting Time | Bonus action",
			"property | Range | Touch",
			"property | Components | V, S",
			"property | Duration | Instantaneous",
			"rule",
			"text | You touch a creature and end one condition on it: Blinded, Deafened, Paralyzed, or Poisoned."
		],
		"tags": [
			"spell",
			"PHB'24",
			"2nd level",
			"Abjuration",
			"Bard",
			"Cleric",
			"Druid",
			"Ranger",
			"Paladin",
			"Artificer"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Locate Animals or Plants",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Divination",
			"rule",
			"property | Casting Time | Action or Ritual",
			"property | Range | Self",
			"property | Components | V, S, M (fur from a bloodhound)",
			"property | Duration | Instantaneous",
			"rule",
			"text | Describe or name a specific kind of Beast, Plant creature, or nonmagical plant. You learn the direction and distance to the closest creature or plant of that kind within 5 miles, if any are present."
		],
		"tags": [
			"spell",
			"PHB'24",
			"2nd level",
			"Divination",
			"Bard",
			"Druid",
			"Ranger",
			"ritual"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Locate Creature",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 4 Divination",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V, S, M (fur from a bloodhound)",
			"property | Duration | Concentration, up to 1 hour",
			"rule",
			"text | Describe or name a creature that is familiar to you. You sense the direction to the creature's location if that creature is within 1,000 feet of you. If the creature is moving, you know the direction of its movement.",
			"text | The spell can locate a specific creature known to you or the nearest creature of a specific kind (such as a human or a unicorn) if you have seen such a creature up close—within 30 feet—at least once. If the creature you described or named is in a different form, such as under the effects of a Flesh to Stone or Polymorph spell, this spell doesn't locate the creature.",
			"text | This spell can't locate a creature if any thickness of lead blocks a direct path between you and the creature."
		],
		"tags": [
			"spell",
			"PHB'24",
			"4th level",
			"Divination",
			"Bard",
			"Cleric",
			"Druid",
			"Ranger",
			"Wizard",
			"Paladin",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Locate Object",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Divination",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V, S, M (a forked twig)",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | Describe or name an object that is familiar to you. You sense the direction to the object's location if that object is within 1,000 feet of you. If the object is in motion, you know the direction of its movement.",
			"text | The spell can locate a specific object known to you if you have seen it up close—within 30 feet—at least once. Alternatively, the spell can locate the nearest object of a particular kind, such as a certain kind of apparel, jewelry, furniture, tool, or weapon.",
			"text | This spell can't locate an object if any thickness of lead blocks a direct path between you and the object."
		],
		"tags": [
			"spell",
			"PHB'24",
			"2nd level",
			"Divination",
			"Bard",
			"Cleric",
			"Druid",
			"Ranger",
			"Wizard",
			"Paladin",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Longstrider",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 1 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Touch",
			"property | Components | V, S, M (a pinch of dirt)",
			"property | Duration | 1 hour",
			"rule",
			"text | You touch a creature. The target's Speed increases by 10 feet until the spell ends.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | You can target one additional creature for each spell slot level above 1."
		],
		"tags": [
			"spell",
			"PHB'24",
			"1st level",
			"Transmutation",
			"Bard",
			"Druid",
			"Ranger",
			"Wizard",
			"Artificer"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Maelstrom",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 5 Evocation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 120 feet",
			"property | Components | V, S, M (paper or leaf in the shape of a funnel)",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | A swirling mass of 5-foot-deep water appears in a 30-foot radius centered on a point you can see within range. The point must be on the ground or in a body of water. Until the spell ends, that area is difficult terrain, and any creature that starts its turn there must succeed on a Strength saving throw or take 6d6 bludgeoning damage and be pulled 10 feet toward the center."
		],
		"tags": [
			"spell",
			"XGE",
			"5th level",
			"Evocation",
			"Druid",
			"Druid",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Magic Stone",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Transmutation Cantrip",
			"rule",
			"property | Casting Time | Bonus action",
			"property | Range | Touch",
			"property | Components | V, S",
			"property | Duration | 1 minute",
			"rule",
			"text | You touch one to three pebbles and imbue them with magic. You or someone else can make a ranged spell attack with one of the pebbles by throwing it or hurling it with a sling. If thrown, a pebble has a range of 60 feet. If someone else attacks with a pebble, that attacker adds your spellcasting ability modifier, not the attacker's, to the attack roll. On a hit, the target takes bludgeoning damage equal to 1d6 + your spellcasting ability modifier. Whether the attack hits or misses, the spell then ends on the stone.",
			"text | If you cast this spell again, the spell ends on any pebbles still affected by your previous casting."
		],
		"tags": [
			"spell",
			"XGE",
			"Cantrips",
			"Transmutation",
			"Druid",
			"Warlock",
			"Artificer",
			"Druid",
			"Warlock"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Mass Cure Wounds",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 5 Abjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 60 feet",
			"property | Components | V, S",
			"property | Duration | Instantaneous",
			"rule",
			"text | A wave of healing energy washes out from a point you can see within range. Choose up to six creatures in a 30-foot-radius Sphere centered on that point. Each target regains Hit Points equal to 5d8 plus your spellcasting ability modifier.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The healing increases by 1d8 for each spell slot level above 5."
		],
		"tags": [
			"spell",
			"PHB'24",
			"5th level",
			"Abjuration",
			"Bard",
			"Cleric",
			"Druid"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Meld into Stone",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 3 Transmutation",
			"rule",
			"property | Casting Time | Action or Ritual",
			"property | Range | Touch",
			"property | Components | V, S",
			"property | Duration | 8 hours",
			"rule",
			"text | You step into a stone object or surface large enough to fully contain your body, merging yourself and your equipment with the stone for the duration. You must touch the stone to do so. Nothing of your presence remains visible or otherwise detectable by nonmagical senses.",
			"text | While merged with the stone, you can't see what occurs outside it, and any Wisdom (Perception) checks you make to hear sounds outside it are made with Disadvantage. You remain aware of the passage of time and can cast spells on yourself while merged in the stone. You can use 5 feet of movement to leave the stone where you entered it, which ends the spell. You otherwise can't move.",
			"text | Minor physical damage to the stone doesn't harm you, but its partial destruction or a change in its shape (to the extent that you no longer fit within it) expels you and deals 6d6 Force damage to you. The stone's complete destruction (or transmutation into a different substance) expels you and deals 50 Force damage to you. If expelled, you move into an unoccupied space closest to where you first entered and have the Prone condition."
		],
		"tags": [
			"spell",
			"PHB'24",
			"3rd level",
			"Transmutation",
			"Cleric",
			"Druid",
			"Ranger",
			"ritual"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Mending",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Transmutation Cantrip",
			"rule",
			"property | Casting Time | 1 minute",
			"property | Range | Touch",
			"property | Components | V, S, M (two lodestones)",
			"property | Duration | Instantaneous",
			"rule",
			"text | This spell repairs a single break or tear in an object you touch, such as a broken chain link, two halves of a broken key, a torn cloak, or a leaking wineskin. As long as the break or tear is no larger than 1 foot in any dimension, you mend it, leaving no trace of the former damage.",
			"text | This spell can physically repair a magic item, but it can't restore magic to such an object."
		],
		"tags": [
			"spell",
			"PHB'24",
			"Cantrips",
			"Transmutation",
			"Bard",
			"Cleric",
			"Druid",
			"Sorcerer",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Message",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Transmutation Cantrip",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 120 feet",
			"property | Components | S, M (a copper wire)",
			"property | Duration | 1 round",
			"rule",
			"text | You point toward a creature within range and whisper a message. The target (and only the target) hears the message and can reply in a whisper that only you can hear.",
			"text | You can cast this spell through solid objects if you are familiar with the target and know it is beyond the barrier. Magical silence; 1 foot of stone, metal, or wood; or a thin sheet of lead blocks the spell."
		],
		"tags": [
			"spell",
			"PHB'24",
			"Cantrips",
			"Transmutation",
			"Bard",
			"Druid",
			"Sorcerer",
			"Wizard",
			"Artificer"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Mirage Arcane",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 7 Illusion",
			"rule",
			"property | Casting Time | 10 minutes",
			"property | Range | Sight",
			"property | Components | V, S",
			"property | Duration | 10 days",
			"rule",
			"text | You make terrain in an area up to 1 mile square look, sound, smell, and even feel like some other sort of terrain. Open fields or a road could be made to resemble a swamp, hill, crevasse, or some other rough or impassable terrain. A pond can be made to seem like a grassy meadow, a precipice like a gentle slope, or a rock-strewn gully like a wide and smooth road.",
			"text | Similarly, you can alter the appearance of structures or add them where none are present. The spell doesn't disguise, conceal, or add creatures.",
			"text | The illusion includes audible, visual, tactile, and olfactory elements, so it can turn clear ground into Difficult Terrain (or vice versa) or otherwise impede movement through the area. Any piece of the illusory terrain (such as a rock or stick) that is removed from the spell's area disappears immediately.",
			"text | Creatures with Truesight can see through the illusion to the terrain's true form; however, all other elements of the illusion remain, so while the creature is aware of the illusion's presence, the creature can still physically interact with the illusion."
		],
		"tags": [
			"spell",
			"PHB'24",
			"7th level",
			"Illusion",
			"Bard",
			"Druid",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Mold Earth",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Transmutation Cantrip",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 30 feet",
			"property | Components | S",
			"property | Duration | Instantaneous or 1 hour (see below)",
			"rule",
			"text | You choose a portion of dirt or stone that you can see within range and that fits within a 5-foot cube. You manipulate it in one of the following ways:",
			"bullet | If you target an area of loose earth, you can instantaneously excavate it, move it along the ground, and deposit it up to 5 feet away. This movement doesn't involve enough force to cause damage.",
			"bullet | You cause shapes, colors, or both to appear on the dirt or stone, spelling out words, creating images, or shaping patterns. The changes last for 1 hour.",
			"bullet | If the dirt or stone you target is on the ground, you cause it to become difficult terrain. Alternatively, you can cause the ground to become normal terrain if it is already difficult terrain. This change lasts for 1 hour.",
			"text | If you cast this spell multiple times, you can have no more than two of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action."
		],
		"tags": [
			"spell",
			"XGE",
			"Cantrips",
			"Transmutation",
			"Druid",
			"Sorcerer",
			"Wizard",
			"Druid",
			"Sorcerer",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Moonbeam",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Evocation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 120 feet",
			"property | Components | V, S, M (a moonseed leaf)",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | A silvery beam of pale light shines down in a 5-foot-radius, 40-foot-high Cylinder centered on a point within range. Until the spell ends, Dim Light fills the Cylinder, and you can take a Magic action on later turns to move the Cylinder up to 60 feet.",
			"text | When the Cylinder appears, each creature in it makes a Constitution saving throw. On a failed save, a creature takes 2d10 Radiant damage, and if the creature is shape-shifted (as a result of the Polymorph spell, for example), it reverts to its true form and can't shape-shift until it leaves the Cylinder. On a successful save, a creature takes half as much damage only. A creature also makes this save when the spell's area moves into its space and when it enters the spell's area or ends its turn there. A creature makes this save only once per turn.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The damage increases by 1d10 for each spell slot level above 2."
		],
		"tags": [
			"spell",
			"PHB'24",
			"2nd level",
			"Evocation",
			"Druid",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Move Earth",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 6 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 120 feet",
			"property | Components | V, S, M (a miniature shovel)",
			"property | Duration | Concentration, up to 2 hours",
			"rule",
			"text | Choose an area of terrain no larger than 40 feet on a side within range. You can reshape dirt, sand, or clay in the area in any manner you choose for the duration. You can raise or lower the area's elevation, create or fill in a trench, erect or flatten a wall, or form a pillar. The extent of any such changes can't exceed half the area's largest dimension. For example, if you affect a 40-foot square, you can create a pillar up to 20 feet high, raise or lower the square's elevation by up to 20 feet, dig a trench up to 20 feet deep, and so on. It takes 10 minutes for these changes to complete. Because the terrain's transformation occurs slowly, creatures in the area can't usually be trapped or injured by the ground's movement.",
			"text | At the end of every 10 minutes you spend Concentrating on the spell, you can choose a new area of terrain to affect within range.",
			"text | This spell can't manipulate natural stone or stone construction. Rocks and structures shift to accommodate the new terrain. If the way you shape the terrain would make a structure unstable, it might collapse.",
			"text | Similarly, this spell doesn't directly affect plant growth. The moved earth carries any plants along with it."
		],
		"tags": [
			"spell",
			"PHB'24",
			"6th level",
			"Transmutation",
			"Druid",
			"Sorcerer",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Pass without Trace",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Abjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V, S, M (ashes from burned mistletoe)",
			"property | Duration | Concentration, up to 1 hour",
			"rule",
			"text | You radiate a concealing aura in a 30-foot Emanation for the duration. While in the aura, you and each creature you choose have a +10 bonus to Dexterity (Stealth) checks and leave no tracks."
		],
		"tags": [
			"spell",
			"PHB'24",
			"2nd level",
			"Abjuration",
			"Druid",
			"Ranger",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Planar Binding",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 5 Abjuration",
			"rule",
			"property | Casting Time | 1 hour",
			"property | Range | 60 feet",
			"property | Components | V, S, M (a jewel worth 1,000+ GP, which the spell consumes)",
			"property | Duration | 24 hours",
			"rule",
			"text | You attempt to bind a Celestial, an Elemental, a Fey, or a Fiend to your service. The creature must be within range for the entire casting of the spell. (Typically, the creature is first summoned into the center of the inverted version of the Magic Circle spell to trap it while this spell is cast.) At the completion of the casting, the target must succeed on a Charisma saving throw or be bound to serve you for the duration. If the creature was summoned or created by another spell, that spell's duration is extended to match the duration of this spell.",
			"text | A bound creature must follow your commands to the best of its ability. You might command the creature to accompany you on an adventure, to guard a location, or to deliver a message. If the creature is Hostile, it strives to twist your commands to achieve its own objectives. If the creature carries out your commands completely before the spell ends, it travels to you to report this fact if you are on the same plane of existence. If you are on a different plane, it returns to the place where you bound it and remains there until the spell ends.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The duration increases with a spell slot of level 6 (10 days), 7 (30 days), 8 (180 days), and 9 (366 days)."
		],
		"tags": [
			"spell",
			"PHB'24",
			"5th level",
			"Abjuration",
			"Bard",
			"Cleric",
			"Druid",
			"Warlock",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Plane Shift",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 7 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Touch",
			"property | Components | V, S, M (a forked, metal rod worth 250+ GP and attuned to a plane of existence)",
			"property | Duration | Instantaneous",
			"rule",
			"text | You and up to eight willing creatures who link hands in a circle are transported to a different plane of existence. You can specify a target destination in general terms, such as the City of Brass on the Elemental Plane of Fire or the palace of Dispater on the second level of the Nine Hells, and you appear in or near that destination, as determined by the DM.",
			"text | Alternatively, if you know the sigil sequence of a teleportation circle on another plane of existence, this spell can take you to that circle. If the teleportation circle is too small to hold all the creatures you transported, they appear in the closest unoccupied spaces next to the circle."
		],
		"tags": [
			"spell",
			"PHB'24",
			"7th level",
			"Conjuration",
			"Cleric",
			"Druid",
			"Sorcerer",
			"Warlock",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Plant Growth",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 3 Transmutation",
			"rule",
			"property | Casting Time | Action (Overgrowth) or 8 hours (Enrichment)",
			"property | Range | 150 feet",
			"property | Components | V, S",
			"property | Duration | Instantaneous",
			"rule",
			"text | This spell channels vitality into plants. The casting time you use determines whether the spell has the Overgrowth or the Enrichment effect below.",
			"description | Overgrowth | Choose a point within range. All normal plants in a 100-foot-radius Sphere centered on that point become thick and overgrown. A creature moving through that area must spend 4 feet of movement for every 1 foot it moves. You can exclude one or more areas of any size within the spell's area from being affected.",
			"description | Enrichment | All plants in a half-mile radius centered on a point within range become enriched for 365 days. The plants yield twice the normal amount of food when harvested. They can benefit from only one Plant Growth per year."
		],
		"tags": [
			"spell",
			"PHB'24",
			"3rd level",
			"Transmutation",
			"Bard",
			"Druid",
			"Ranger"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Poison Spray",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Necromancy Cantrip",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 30 feet",
			"property | Components | V, S",
			"property | Duration | Instantaneous",
			"rule",
			"text | You spray toxic mist at a creature within range. Make a ranged spell attack against the target. On a hit, the target takes 1d12 Poison damage.",
			"section | At higher levels",
			"description | Cantrip Upgrade | The damage increases by 1d12 when you reach levels 5 (2d12), 11 (3d12), and 17 (4d12)."
		],
		"tags": [
			"spell",
			"PHB'24",
			"Cantrips",
			"Necromancy",
			"Druid",
			"Sorcerer",
			"Warlock",
			"Wizard",
			"Artificer"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Polymorph",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 4 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 60 feet",
			"property | Components | V, S, M (a caterpillar cocoon)",
			"property | Duration | Concentration, up to 1 hour",
			"rule",
			"text | You attempt to transform a creature that you can see within range into a Beast. The target must succeed on a Wisdom saving throw or shape-shift into Beast form for the duration. That form can be any Beast you choose that has a Challenge Rating equal to or less than the target's (or the target's level if it doesn't have a Challenge Rating). The target's game statistics are replaced by the stat block of the chosen Beast, but the target retains its alignment, personality, creature type, Hit Points, and Hit Point Dice.",
			"text | The target gains a number of Temporary Hit Points equal to the Hit Points of the Beast form. These Temporary Hit Points vanish if any remain when the spell ends. The spell ends early on the target if it has no Temporary Hit Points left.",
			"text | The target is limited in the actions it can perform by the anatomy of its new form, and it can't speak or cast spells.",
			"text | The target's gear melds into the new form. The creature can't use or otherwise benefit from any of that equipment."
		],
		"tags": [
			"spell",
			"PHB'24",
			"4th level",
			"Transmutation",
			"Bard",
			"Druid",
			"Sorcerer",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Primal Savagery",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Transmutation Cantrip",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | S",
			"property | Duration | Instantaneous",
			"rule",
			"text | You channel primal magic to cause your teeth or fingernails to sharpen, ready to deliver a corrosive attack. Make a melee spell attack against one creature within 5 feet of you. On a hit, the target takes 1d10 acid damage. After you make the attack, your teeth or fingernails return to normal.",
			"text | The spell's damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10)."
		],
		"tags": [
			"spell",
			"XGE",
			"Cantrips",
			"Transmutation",
			"Druid",
			"Druid"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Primordial Ward",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 6 Abjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | You have resistance to acid, cold, fire, lightning, and thunder damage for the spell's duration.",
			"text | When you take damage of one of those types, you can use your reaction to gain immunity to that type of damage, including against the triggering damage. If you do so, the resistances end, and you have the immunity until the end of your next turn, at which time the spell ends."
		],
		"tags": [
			"spell",
			"XGE",
			"6th level",
			"Abjuration",
			"Druid",
			"Druid",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Produce Flame",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Conjuration Cantrip",
			"rule",
			"property | Casting Time | Bonus action",
			"property | Range | Self",
			"property | Components | V, S",
			"property | Duration | 10 minutes",
			"rule",
			"text | A flickering flame appears in your hand and remains there for the duration. While there, the flame emits no heat and ignites nothing, and it sheds Bright Light in a 20-foot radius and Dim Light for an additional 20 feet. The spell ends if you cast it again.",
			"text | Until the spell ends, you can take a Magic action to hurl fire at a creature or an object within 60 feet of you. Make a ranged spell attack. On a hit, the target takes 1d8 Fire damage.",
			"section | At higher levels",
			"description | Cantrip Upgrade | The damage increases by 1d8 when you reach levels 5 (2d8), 11 (3d8), and 17 (4d8)."
		],
		"tags": [
			"spell",
			"PHB'24",
			"Cantrips",
			"Conjuration",
			"Druid"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Protection from Energy",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 3 Abjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Touch",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 1 hour",
			"rule",
			"text | For the duration, the willing creature you touch has Resistance to one damage type of your choice: Acid, Cold, Fire, Lightning, or Thunder."
		],
		"tags": [
			"spell",
			"PHB'24",
			"3rd level",
			"Abjuration",
			"Cleric",
			"Druid",
			"Ranger",
			"Sorcerer",
			"Wizard",
			"Artificer",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Protection from Evil and Good",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 1 Abjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Touch",
			"property | Components | V, S, M (a flask of Holy Water worth 25+ GP, which the spell consumes)",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | Until the spell ends, one willing creature you touch is protected against creatures that are Aberrations, Celestials, Elementals, Fey, Fiends, or Undead. The protection grants several benefits. Creatures of those types have Disadvantage on attack rolls against the target. The target also can't be possessed by or gain the Charmed or Frightened conditions from them. If the target is already possessed, Charmed, or Frightened by such a creature, the target has Advantage on any new saving throw against the relevant effect."
		],
		"tags": [
			"spell",
			"PHB'24",
			"1st level",
			"Abjuration",
			"Cleric",
			"Druid",
			"Warlock",
			"Wizard",
			"Paladin",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Protection from Poison",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Abjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Touch",
			"property | Components | V, S",
			"property | Duration | 1 hour",
			"rule",
			"text | You touch a creature and end the Poisoned condition on it. For the duration, the target has Advantage on saving throws to avoid or end the Poisoned condition, and it has Resistance to Poison damage."
		],
		"tags": [
			"spell",
			"PHB'24",
			"2nd level",
			"Abjuration",
			"Cleric",
			"Druid",
			"Ranger",
			"Paladin",
			"Artificer"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Purify Food and Drink",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 1 Transmutation",
			"rule",
			"property | Casting Time | Action or Ritual",
			"property | Range | 10 feet",
			"property | Components | V, S",
			"property | Duration | Instantaneous",
			"rule",
			"text | You remove poison and rot from nonmagical food and drink in a 5-foot-radius Sphere centered on a point within range."
		],
		"tags": [
			"spell",
			"PHB'24",
			"1st level",
			"Transmutation",
			"Cleric",
			"Druid",
			"Paladin",
			"Artificer",
			"ritual"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Regenerate",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 7 Transmutation",
			"rule",
			"property | Casting Time | 1 minute",
			"property | Range | Touch",
			"property | Components | V, S, M (a prayer wheel)",
			"property | Duration | 1 hour",
			"rule",
			"text | A creature you touch regains 4d8 + 15 Hit Points. For the duration, the target regains 1 Hit Point at the start of each of its turns, and any severed body parts regrow after 2 minutes."
		],
		"tags": [
			"spell",
			"PHB'24",
			"7th level",
			"Transmutation",
			"Bard",
			"Cleric",
			"Druid"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Reincarnate",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 5 Necromancy",
			"rule",
			"property | Casting Time | 1 hour",
			"property | Range | Touch",
			"property | Components | V, S, M (rare oils worth 1,000+ GP, which the spell consumes)",
			"property | Duration | Instantaneous",
			"rule",
			"text | You touch a dead Humanoid or a piece of one. If the creature has been dead no longer than 10 days, the spell forms a new body for it and calls the soul to enter that body. Roll 1d10 and consult the table below to determine the body's species, or the DM chooses another playable species.",
			"text | 1d10｜Species",
			"text | 1｜Aasimar",
			"text | 2｜Dragonborn",
			"text | 3｜Dwarf",
			"text | 4｜Elf",
			"text | 5｜Gnome",
			"text | 6｜Goliath",
			"text | 7｜Halfling",
			"text | 8｜Human",
			"text | 9｜Orc",
			"text | 10｜Tiefling",
			"text | The reincarnated creature makes any choices that a species' description offers, and the creature recalls its former life. It retains the capabilities it had in its original form, except it loses the traits of its previous species and gains the traits of its new one."
		],
		"tags": [
			"spell",
			"PHB'24",
			"5th level",
			"Necromancy",
			"Druid"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Resistance",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Abjuration Cantrip",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Touch",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | You touch a willing creature and choose a damage type: Acid, Bludgeoning, Cold, Fire, Lightning, Necrotic, Piercing, Poison, Radiant, Slashing, or Thunder. When the creature takes damage of the chosen type before the spell ends, the creature reduces the total damage taken by 1d4. A creature can benefit from this spell only once per turn."
		],
		"tags": [
			"spell",
			"PHB'24",
			"Cantrips",
			"Abjuration",
			"Cleric",
			"Druid",
			"Artificer",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Reverse Gravity",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 7 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 100 feet",
			"property | Components | V, S, M (a lodestone and iron filings)",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | This spell reverses gravity in a 50-foot-radius, 100-foot high Cylinder centered on a point within range. All creatures and objects in that area that aren't anchored to the ground fall upward and reach the top of the Cylinder. A creature can make a Dexterity saving throw to grab a fixed object it can reach, thus avoiding the fall upward.",
			"text | If a ceiling or an anchored object is encountered in this upward fall, creatures and objects strike it just as they would during a downward fall. If an affected creature or object reaches the Cylinder's top without striking anything, it hovers there for the duration. When the spell ends, affected objects and creatures fall downward."
		],
		"tags": [
			"spell",
			"PHB'24",
			"7th level",
			"Transmutation",
			"Druid",
			"Sorcerer",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Revivify",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 3 Necromancy",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Touch",
			"property | Components | V, S, M (a diamond worth 300+ GP, which the spell consumes)",
			"property | Duration | Instantaneous",
			"rule",
			"text | You touch a creature that has died within the last minute. That creature revives with 1 Hit Point. This spell can't revive a creature that has died of old age, nor does it restore any missing body parts."
		],
		"tags": [
			"spell",
			"PHB'24",
			"3rd level",
			"Necromancy",
			"Cleric",
			"Druid",
			"Ranger",
			"Paladin",
			"Artificer"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Scrying",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 5 Divination",
			"rule",
			"property | Casting Time | 10 minutes",
			"property | Range | Self",
			"property | Components | V, S, M (a focus worth 1,000+ GP, such as a crystal ball, mirror, or water-filled font)",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | You can see and hear a creature you choose that is on the same plane of existence as you. The target makes a Wisdom saving throw, which is modified (see the tables below) by how well you know the target and the sort of physical connection you have to it. The target doesn't know what it is making the save against, only that it feels uneasy.",
			"text | Your Knowledge of the Target Is...｜Save Modifier",
			"text | Secondhand (heard of the target)｜+5",
			"text | Firsthand (met the target)｜+0",
			"text | Extensive (know the target well)｜-5",
			"text | You Have the Target's...｜Save Modifier",
			"text | Picture or other likeness｜-2",
			"text | Garment or other possession｜-4",
			"text | Body part, lock of hair, or bit of nail｜-10",
			"text | On a successful save, the target isn't affected, and you can't use this spell on it again for 24 hours.",
			"text | On a failed save, the spell creates an Invisible, intangible sensor within 10 feet of the target. You can see and hear through the sensor as if you were there. The sensor moves with the target, remaining within 10 feet of it for the duration. If something can see the sensor, it appears as a luminous orb about the size of your fist.",
			"text | Instead of targeting a creature, you can target a location you have seen. When you do so, the sensor appears at that location and doesn't move."
		],
		"tags": [
			"spell",
			"PHB'24",
			"5th level",
			"Divination",
			"Bard",
			"Cleric",
			"Druid",
			"Warlock",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Shape Water",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Transmutation Cantrip",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 30 feet",
			"property | Components | S",
			"property | Duration | Instantaneous or 1 hour (see below)",
			"rule",
			"text | You choose an area of water that you can see within range and that fits within a 5-foot cube. You manipulate it in one of the following ways:",
			"bullet | You instantaneously move or otherwise change the flow of the water as you direct, up to 5 feet in any direction. This movement doesn't have enough force to cause damage.",
			"bullet | You cause the water to form into simple shapes and animate at your direction. This change lasts for 1 hour.",
			"bullet | You change the water's color or opacity. The water must be changed in the same way throughout. This change lasts for 1 hour.",
			"bullet | You freeze the water, provided that there are no creatures in it. The water unfreezes in 1 hour.",
			"text | If you cast this spell multiple times, you can have no more than two of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action."
		],
		"tags": [
			"spell",
			"XGE",
			"Cantrips",
			"Transmutation",
			"Druid",
			"Sorcerer",
			"Wizard",
			"Druid",
			"Sorcerer",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Shapechange",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 9 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V, S, M (a jade circlet worth 1,500+ GP)",
			"property | Duration | Concentration, up to 1 hour",
			"rule",
			"text | You shape-shift into another creature for the duration or until you take a Magic action to shape-shift into a different eligible form. The new form must be of a creature that has a Challenge Rating no higher than your level or Challenge Rating. You must have seen the sort of creature before, and it can't be a Construct or an Undead.",
			"text | When you cast the spell, you gain a number of Temporary Hit Points equal to the Hit Points of the first form into which you shape-shift. These Temporary Hit Points vanish if any remain when the spell ends.",
			"text | Your game statistics are replaced by the stat block of the chosen form, but you retain your creature type; alignment; personality; Intelligence, Wisdom, and Charisma scores; Hit Points; Hit Point Dice; proficiencies; and ability to communicate. If you have the Spellcasting feature, you retain it too.",
			"text | Upon shape-shifting, you determine whether your equipment drops to the ground or changes in size and shape to fit the new form while you're in it."
		],
		"tags": [
			"spell",
			"PHB'24",
			"9th level",
			"Transmutation",
			"Druid",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Shillelagh",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Transmutation Cantrip",
			"rule",
			"property | Casting Time | Bonus action",
			"property | Range | Self",
			"property | Components | V, S, M (mistletoe)",
			"property | Duration | 1 minute",
			"rule",
			"text | A Club or Quarterstaff you are holding is imbued with nature's power. For the duration, you can use your spellcasting ability instead of Strength for the attack and damage rolls of melee attacks using that weapon, and the weapon's damage die becomes a d8. If the attack deals damage, it can be Force damage or the weapon's normal damage type (your choice).",
			"text | The spell ends early if you cast it again or if you let go of the weapon.",
			"section | At higher levels",
			"description | Cantrip Upgrade | The damage die changes when you reach levels 5 (d10), 11 (d12), and 17 (2d6)."
		],
		"tags": [
			"spell",
			"PHB'24",
			"Cantrips",
			"Transmutation",
			"Druid"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Skywrite",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Transmutation",
			"rule",
			"property | Casting Time | Action or Ritual",
			"property | Range | Sight",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 1 hour",
			"rule",
			"text | You cause up to ten words to form in a part of the sky you can see. The words appear to be made of cloud and remain in place for the spell's duration. The words dissipate when the spell ends. A strong wind can disperse the clouds and end the spell early."
		],
		"tags": [
			"spell",
			"XGE",
			"2nd level",
			"Transmutation",
			"Bard",
			"Druid",
			"Wizard",
			"Artificer",
			"Bard",
			"Druid",
			"Wizard",
			"concentration",
			"ritual"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Sleet Storm",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 3 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 150 feet",
			"property | Components | V, S, M (a miniature umbrella)",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | Until the spell ends, sleet falls in a 40-foot-tall, 20-foot-radius Cylinder centered on a point you choose within range. The area is Heavily Obscured, and exposed flames in the area are doused.",
			"text | Ground in the Cylinder is Difficult Terrain. When a creature enters the Cylinder for the first time on a turn or starts its turn there, it must succeed on a Dexterity saving throw or have the Prone condition and lose Concentration."
		],
		"tags": [
			"spell",
			"PHB'24",
			"3rd level",
			"Conjuration",
			"Druid",
			"Sorcerer",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Snare",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 1 Abjuration",
			"rule",
			"property | Casting Time | 1 minute",
			"property | Range | Touch",
			"property | Components | S, M (25 feet of rope, which the spell consumes)",
			"property | Duration | 8 hours",
			"rule",
			"text | As you cast this spell, you use the rope to create a circle with a 5-foot radius on the ground or the floor. When you finish casting, the rope disappears and the circle becomes a magic trap.",
			"text | This trap is nearly invisible, requiring a successful Intelligence (Investigation) check against your spell save DC to be discerned.",
			"text | The trap triggers when a Small, Medium, or Large creature moves onto the ground or the floor in the spell's radius. That creature must succeed on a Dexterity saving throw or be magically hoisted into the air, leaving it hanging upside down 3 feet above the ground or the floor. The creature is restrained there until the spell ends.",
			"text | A restrained creature can make a Dexterity saving throw at the end of each of its turns, ending the effect on itself on a success. Alternatively, the creature or someone else who can reach it can use an action to make an Intelligence (Arcana) check against your spell save DC. On a success, the restrained effect ends.",
			"text | After the trap is triggered, the spell ends when no creature is restrained by it."
		],
		"tags": [
			"spell",
			"XGE",
			"1st level",
			"Abjuration",
			"Druid",
			"Ranger",
			"Wizard",
			"Artificer",
			"Druid",
			"Ranger",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Songal's Elemental Suffusion",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 5 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V, S, M (a pearl worth 100+ GP)",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | You imbue yourself with the elemental power of genies. You gain the following benefits until the spell ends:",
			"bullet | <b>Elemental Immunity.</b> When you cast this spell, choose one of the following damage types: Acid, Cold, Fire, Lightning, or Thunder. You have Resistance to the chosen damage type.",
			"bullet | <b>Elemental Pulse.</b> When you cast this spell and at the start of each of your subsequent turns, you release a burst of elemental energy in a 15-foot Emanation originating from yourself. Each creature of your choice in that area makes a Dexterity saving throw. On a failed save, a creature takes 2d6 Acid, Cold, Fire, Lightning, or Thunder damage (your choice) and has the Prone condition. On a successful save, a creature takes half as much damage only.",
			"bullet | <b>Flight.</b> You gain a Fly Speed of 30 feet and can hover.",
			"description | Casting as a Circle Spell | If the spell is cast as a Circle spell, its casting time increases to 1 minute, and its duration increases to Concentration, up to 10 minutes. For each secondary caster who participates in the casting, you can choose one additional creature, to a maximum of nine additional creatures. The chosen creatures also gain the benefits of the spell for its duration.",
			"text | When the spell is cast, each secondary caster must expend a level 2+ spell slot; otherwise, the spell fails."
		],
		"tags": [
			"spell",
			"FRHoF",
			"5th level",
			"Transmutation",
			"Druid",
			"Sorcerer",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Spare the Dying",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Necromancy Cantrip",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 15 feet",
			"property | Components | V, S",
			"property | Duration | Instantaneous",
			"rule",
			"text | Choose a creature within range that has 0 Hit Points and isn't dead. The creature becomes Stable.",
			"section | At higher levels",
			"description | Cantrip Upgrade | The range doubles when you reach levels 5 (30 feet), 11 (60 feet), and 17 (120 feet)."
		],
		"tags": [
			"spell",
			"PHB'24",
			"Cantrips",
			"Necromancy",
			"Cleric",
			"Druid",
			"Artificer"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Speak with Animals",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 1 Divination",
			"rule",
			"property | Casting Time | Action or Ritual",
			"property | Range | Self",
			"property | Components | V, S",
			"property | Duration | 10 minutes",
			"rule",
			"text | For the duration, you can comprehend and verbally communicate with Beasts, and you can use any of the Influence action's skill options with them.",
			"text | Most Beasts have little to say about topics that don't pertain to survival or companionship, but at minimum, a Beast can give you information about nearby locations and monsters, including whatever it has perceived within the past day."
		],
		"tags": [
			"spell",
			"PHB'24",
			"1st level",
			"Divination",
			"Bard",
			"Druid",
			"Ranger",
			"Warlock",
			"ritual"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Speak with Plants",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 3 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V, S",
			"property | Duration | 10 minutes",
			"rule",
			"text | You imbue plants in an immobile 30-foot Emanation with limited sentience and animation, giving them the ability to communicate with you and follow your simple commands. You can question plants about events in the spell's area within the past day, gaining information about creatures that have passed, weather, and other circumstances.",
			"text | You can also turn Difficult Terrain caused by plant growth (such as thickets and undergrowth) into ordinary terrain that lasts for the duration. Or you can turn ordinary terrain where plants are present into Difficult Terrain that lasts for the duration.",
			"text | The spell doesn't enable plants to uproot themselves and move about, but they can move their branches, tendrils, and stalks for you.",
			"text | If a Plant creature is in the area, you can communicate with it as if you shared a common language."
		],
		"tags": [
			"spell",
			"PHB'24",
			"3rd level",
			"Transmutation",
			"Bard",
			"Druid",
			"Ranger"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Spike Growth",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 150 feet",
			"property | Components | V, S, M (seven thorns)",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | The ground in a 20-foot-radius Sphere centered on a point within range sprouts hard spikes and thorns. The area becomes Difficult Terrain for the duration. When a creature moves into or within the area, it takes 2d4 Piercing damage for every 5 feet it travels.",
			"text | The transformation of the ground is camouflaged to look natural. Any creature that can't see the area when the spell is cast must take a Search action and succeed on a Wisdom (Perception or Survival) check against your spell save DC to recognize the terrain as hazardous before entering it."
		],
		"tags": [
			"spell",
			"PHB'24",
			"2nd level",
			"Transmutation",
			"Druid",
			"Ranger",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Starry Wisp",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Evocation Cantrip",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 60 feet",
			"property | Components | V, S",
			"property | Duration | Instantaneous",
			"rule",
			"text | You launch a mote of light at one creature or object within range. Make a ranged spell attack against the target. On a hit, the target takes 1d8 Radiant damage, and until the end of your next turn, it emits Dim Light in a 10-foot radius and can't benefit from the Invisible condition.",
			"section | At higher levels",
			"description | Cantrip Upgrade | The damage increases by 1d8 when you reach levels 5 (2d8), 11 (3d8), and 17 (4d8)."
		],
		"tags": [
			"spell",
			"PHB'24",
			"Cantrips",
			"Evocation",
			"Bard",
			"Druid"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Stone Shape",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 4 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Touch",
			"property | Components | V, S, M (soft clay)",
			"property | Duration | Instantaneous",
			"rule",
			"text | You touch a stone object of Medium size or smaller or a section of stone no more than 5 feet in any dimension and form it into any shape you like. For example, you could shape a large rock into a weapon, statue, or coffer, or you could make a small passage through a wall that is 5 feet thick. You could also shape a stone door or its frame to seal the door shut. The object you create can have up to two hinges and a latch, but finer mechanical detail isn't possible."
		],
		"tags": [
			"spell",
			"PHB'24",
			"4th level",
			"Transmutation",
			"Cleric",
			"Druid",
			"Wizard",
			"Artificer"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Stoneskin",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 4 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Touch",
			"property | Components | V, S, M (diamond dust worth 100+ GP, which the spell consumes)",
			"property | Duration | Concentration, up to 1 hour",
			"rule",
			"text | Until the spell ends, one willing creature you touch has Resistance to Bludgeoning, Piercing, and Slashing damage."
		],
		"tags": [
			"spell",
			"PHB'24",
			"4th level",
			"Transmutation",
			"Druid",
			"Ranger",
			"Sorcerer",
			"Wizard",
			"Artificer",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Storm of Vengeance",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 9 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 1 mile",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | A churning storm cloud forms for the duration, centered on a point within range and spreading to a radius of 300 feet. Each creature under the cloud when it appears must succeed on a Constitution saving throw or take 2d6 Thunder damage and have the Deafened condition for the duration.",
			"text | At the start of each of your later turns, the storm produces different effects, as detailed below.",
			"description | Turn 2 | Acidic rain falls. Each creature and object under the cloud takes 4d6 Acid damage.",
			"description | Turn 3 | You call six bolts of lightning from the cloud to strike six different creatures or objects beneath it. Each target makes a Dexterity saving throw, taking 10d6 Lightning damage on a failed save or half as much damage on a successful one.",
			"description | Turn 4 | Hailstones rain down. Each creature under the cloud takes 2d6 Bludgeoning damage.",
			"description | Turns 5-10 | Gusts and freezing rain assail the area under the cloud. Each creature there takes 1d6 Cold damage. Until the spell ends, the area is Difficult Terrain and Heavily Obscured, ranged attacks with weapons are impossible there, and strong wind blows through the area."
		],
		"tags": [
			"spell",
			"PHB'24",
			"9th level",
			"Conjuration",
			"Druid",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Summon Beast",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 90 feet",
			"property | Components | V, S, M (a feather, tuft of fur, and fish tail inside a gilded acorn worth 200+ GP)",
			"property | Duration | Concentration, up to 1 hour",
			"rule",
			"text | You call forth a bestial spirit. It manifests in an unoccupied space that you can see within range and uses the Bestial Spirit stat block. When you cast the spell, choose an environment: Air, Land, or Water. The creature resembles an animal of your choice that is native to the chosen environment, which determines certain details in its stat block. The creature disappears when it drops to 0 Hit Points or when the spell ends.",
			"text | The creature is an ally to you and your allies. In combat, the creature shares your Initiative count, but it takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don't issue any, it takes the Dodge action and uses its movement to avoid danger.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | Use the spell slot's level for the spell's level in the stat block."
		],
		"tags": [
			"spell",
			"PHB'24",
			"2nd level",
			"Conjuration",
			"Druid",
			"Ranger",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Summon Elemental",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 4 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 90 feet",
			"property | Components | V, S, M (air, a pebble, ash, and water inside a gold-inlaid vial worth 400+ GP)",
			"property | Duration | Concentration, up to 1 hour",
			"rule",
			"text | You call forth an Elemental spirit. It manifests in an unoccupied space that you can see within range and uses the Elemental Spirit stat block. When you cast the spell, choose an element: Air, Earth, Fire, or Water. The creature resembles a bipedal form wreathed in the chosen element, which determines certain details in its stat block. The creature disappears when it drops to 0 Hit Points or when the spell ends.",
			"text | The creature is an ally to you and your allies. In combat, the creature shares your Initiative count, but it takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don't issue any, it takes the Dodge action and uses its movement to avoid danger.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | Use the spell slot's level for the spell's level in the stat block."
		],
		"tags": [
			"spell",
			"PHB'24",
			"4th level",
			"Conjuration",
			"Druid",
			"Ranger",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Summon Fey",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 3 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 90 feet",
			"property | Components | V, S, M (a gilded flower worth 300+ GP)",
			"property | Duration | Concentration, up to 1 hour",
			"rule",
			"text | You call forth a Fey spirit. It manifests in an unoccupied space that you can see within range and uses the Fey Spirit stat block. When you cast the spell, choose a mood: Fuming, Mirthful, or Tricksy. The creature resembles a Fey creature of your choice marked by the chosen mood, which determines certain details in its stat block. The creature disappears when it drops to 0 Hit Points or when the spell ends.",
			"text | The creature is an ally to you and your allies. In combat, the creature shares your Initiative count, but it takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don't issue any, it takes the Dodge action and uses its movement to avoid danger.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | Use the spell slot's level for the spell's level in the stat block."
		],
		"tags": [
			"spell",
			"PHB'24",
			"3rd level",
			"Conjuration",
			"Druid",
			"Ranger",
			"Warlock",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Sunbeam",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 6 Evocation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V, S, M (a magnifying glass)",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | You launch a sunbeam in a 5-foot-wide, 60-foot-long Line. Each creature in the Line makes a Constitution saving throw. On a failed save, a creature takes 6d8 Radiant damage and has the Blinded condition until the start of your next turn. On a successful save, it takes half as much damage only.",
			"text | Until the spell ends, you can take a Magic action to create a new Line of radiance.",
			"text | For the duration, a mote of brilliant radiance shines above you. It sheds Bright Light in a 30-foot radius and Dim Light for an additional 30 feet. This light is sunlight."
		],
		"tags": [
			"spell",
			"PHB'24",
			"6th level",
			"Evocation",
			"Cleric",
			"Druid",
			"Sorcerer",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Sunburst",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 8 Evocation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 150 feet",
			"property | Components | V, S, M (a piece of sunstone)",
			"property | Duration | Instantaneous",
			"rule",
			"text | Brilliant sunlight flashes in a 60-foot-radius Sphere centered on a point you choose within range. Each creature in the Sphere makes a Constitution saving throw. On a failed save, a creature takes 12d6 Radiant damage and has the Blinded condition for 1 minute. On a successful save, it takes half as much damage only.",
			"text | A creature Blinded by this spell makes another Constitution saving throw at the end of each of its turns, ending the effect on itself on a success.",
			"text | This spell dispels Darkness in its area that was created by any spell."
		],
		"tags": [
			"spell",
			"PHB'24",
			"8th level",
			"Evocation",
			"Cleric",
			"Druid",
			"Sorcerer",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Syluné's Viper",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 3 Conjuration",
			"rule",
			"property | Casting Time | Bonus action",
			"property | Range | Self",
			"property | Components | V, S, M (a snake fang)",
			"property | Duration | 1 hour",
			"rule",
			"text | A shimmering, spectral snake encircles your body for the duration. You gain 15 Temporary Hit Points; the spell ends early if you have no Temporary Hit Points left.",
			"text | While the spell is active, you gain the following benefits:",
			"bullet | <b>Climbing.</b> You gain a Climb Speed equal to your Speed.",
			"bullet | <b>Venomous Bite.</b> As a Magic action, you can make a ranged spell attack using the snake against one creature within 50 feet. On a hit, the target takes 1d6 Force damage and has the Poisoned condition until the start of your next turn. While Poisoned, the target has the Incapacitated condition.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | For each spell slot level above 3, the number of Temporary Hit Points you gain from this spell increases by 5, and the damage of Venomous Bite increases by 1d6."
		],
		"tags": [
			"spell",
			"FRHoF",
			"3rd level",
			"Conjuration",
			"Druid",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Symbol",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 7 Abjuration",
			"rule",
			"property | Casting Time | 1 minute",
			"property | Range | Touch",
			"property | Components | V, S, M (powdered diamond worth 1,000+ GP, which the spell consumes)",
			"property | Duration | Until dispelled or triggered",
			"rule",
			"text | You inscribe a harmful glyph either on a surface (such as a section of floor or wall) or within an object that can be closed (such as a book or chest). The glyph can cover an area no larger than 10 feet in diameter. If you choose an object, it must remain in place; if it is moved more than 10 feet from where you cast this spell, the glyph is broken, and the spell ends without being triggered.",
			"text | The glyph is nearly imperceptible and requires a successful Wisdom (Perception) check against your spell save DC to notice.",
			"text | When you inscribe the glyph, you set its trigger and choose which effect the symbol bears: Death, Discord, Fear, Pain, Sleep, or Stunning. Each one is explained below.",
			"description | Set the Trigger | You decide what triggers the glyph when you cast the spell. For glyphs inscribed on a surface, common triggers include touching or stepping on the glyph, removing another object covering it, or approaching within a certain distance of it. For glyphs inscribed within an object, common triggers include opening that object or seeing the glyph.",
			"text | You can refine the trigger so that only creatures of certain types activate it (for example, the glyph could be set to affect Aberrations). You can also set conditions for creatures that don't trigger the glyph, such as those who say a certain password.",
			"text | Once triggered, the glyph glows, filling a 60-foot-radius Sphere with Dim Light for 10 minutes, after which time the spell ends. Each creature in the Sphere when the glyph activates is targeted by its effect, as is a creature that enters the Sphere for the first time on a turn or ends its turn there. A creature is targeted only once per turn.",
			"description | Death | Each target makes a Constitution saving throw, taking 10d10 Necrotic damage on a failed save or half as much damage on a successful save.",
			"description | Discord | Each target makes a Wisdom saving throw. On a failed save, a target argues with other creatures for 1 minute. During this time, it is incapable of meaningful communication and has Disadvantage on attack rolls and ability checks.",
			"description | Fear | Each target must succeed on a Wisdom saving throw or have the Frightened condition for 1 minute. While Frightened, the target must move at least 30 feet away from the glyph on each of its turns, if able.",
			"description | Pain | Each target must succeed on a Constitution saving throw or have the Incapacitated condition for 1 minute.",
			"description | Sleep | Each target must succeed on a Wisdom saving throw or have the Unconscious condition for 10 minutes. A creature awakens if it takes damage or if someone takes an action to shake it awake.",
			"description | Stunning | Each target must succeed on a Wisdom saving throw or have the Stunned condition for 1 minute."
		],
		"tags": [
			"spell",
			"PHB'24",
			"7th level",
			"Abjuration",
			"Bard",
			"Cleric",
			"Druid",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Thorn Whip",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Transmutation Cantrip",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 30 feet",
			"property | Components | V, S, M (the stem of a plant with thorns)",
			"property | Duration | Instantaneous",
			"rule",
			"text | You create a vine-like whip covered in thorns that lashes out at your command toward a creature in range. Make a melee spell attack against the target. On a hit, the target takes 1d6 Piercing damage, and if it is Large or smaller, you can pull it up to 10 feet closer to you.",
			"section | At higher levels",
			"description | Cantrip Upgrade | The damage increases by 1d6 when you reach levels 5 (2d6), 11 (3d6), and 17 (4d6)."
		],
		"tags": [
			"spell",
			"PHB'24",
			"Cantrips",
			"Transmutation",
			"Druid",
			"Artificer"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Thunderclap",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Evocation Cantrip",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | S",
			"property | Duration | Instantaneous",
			"rule",
			"text | Each creature in a 5-foot Emanation originating from you must succeed on a Constitution saving throw or take 1d6 Thunder damage. The spell's thunderous sound can be heard up to 100 feet away.",
			"section | At higher levels",
			"description | Cantrip Upgrade | The damage increases by 1d6 when you reach levels 5 (2d6), 11 (3d6), and 17 (4d6)."
		],
		"tags": [
			"spell",
			"PHB'24",
			"Cantrips",
			"Evocation",
			"Bard",
			"Druid",
			"Sorcerer",
			"Warlock",
			"Wizard",
			"Artificer"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Thunderwave",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 1 Evocation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V, S",
			"property | Duration | Instantaneous",
			"rule",
			"text | You unleash a wave of thunderous energy. Each creature in a 15-foot Cube originating from you makes a Constitution saving throw. On a failed save, a creature takes 2d8 Thunder damage and is pushed 10 feet away from you. On a successful save, a creature takes half as much damage only.",
			"text | In addition, unsecured objects that are entirely within the Cube are pushed 10 feet away from you, and a thunderous boom is audible within 300 feet.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The damage increases by 1d8 for each spell slot level above 1."
		],
		"tags": [
			"spell",
			"PHB'24",
			"1st level",
			"Evocation",
			"Bard",
			"Druid",
			"Sorcerer",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Tidal Wave",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 3 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 120 feet",
			"property | Components | V, S, M (a drop of water)",
			"property | Duration | Instantaneous",
			"rule",
			"text | You conjure up a wave of water that crashes down on an area within range. The area can be up to 30 feet long, up to 10 feet wide, and up to 10 feet tall. Each creature in that area must make a Dexterity saving throw. On a failed save, a creature takes 4d8 bludgeoning damage and is knocked prone. On a successful save, a creature takes half as much damage and isn't knocked prone. The water then spreads out across the ground in all directions, extinguishing unprotected flames in its area and within 30 feet of it, and then it vanishes."
		],
		"tags": [
			"spell",
			"XGE",
			"3rd level",
			"Conjuration",
			"Druid",
			"Sorcerer",
			"Wizard",
			"Druid",
			"Sorcerer",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Transmute Rock",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 5 Transmutation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 120 feet",
			"property | Components | V, S, M (clay and water)",
			"property | Duration | Until dispelled",
			"rule",
			"text | You choose an area of stone or mud that you can see that fits within a 40-foot cube and is within range, and choose one of the following effects.",
			"description | Transmute Rock to Mud | Nonmagical rock of any sort in the area becomes an equal volume of thick, flowing mud that remains for the spell's duration.",
			"text | The ground in the spell's area becomes muddy enough that creatures can sink into it. Each foot that a creature moves through the mud costs 4 feet of movement, and any creature on the ground when you cast the spell must make a Strength saving throw. A creature must also make the saving throw when it moves into the area for the first time on a turn or ends its turn there. On a failed save, a creature sinks into the mud and is restrained, though it can use an action to end the restrained condition on itself by pulling itself free of the mud.",
			"text | If you cast the spell on a ceiling, the mud falls. Any creature under the mud when it falls must make a Dexterity saving throw. A creature takes 4d8 bludgeoning damage on a failed save, or half as much damage on a successful one.",
			"description | Transmute Mud to Rock | Nonmagical mud or quicksand in the area no more than 10 feet deep transforms into soft stone for the spell's duration. Any creature in the mud when it transforms must make a Dexterity saving throw. On a successful save, a creature is shunted safely to the surface in an unoccupied space. On a failed save, a creature becomes restrained by the rock. A restrained creature, or another creature within reach, can use an action to try to break the rock by succeeding on a DC 20 Strength check or by dealing damage to it. The rock has AC 15 and 25 hit points, and it is immune to poison and psychic damage."
		],
		"tags": [
			"spell",
			"XGE",
			"5th level",
			"Transmutation",
			"Druid",
			"Wizard",
			"Artificer",
			"Druid",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Transport via Plants",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 6 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 10 feet",
			"property | Components | V, S",
			"property | Duration | 10 minutes",
			"rule",
			"text | This spell creates a magical link between a Large or larger inanimate plant within range and another plant, at any distance, on the same plane of existence. You must have seen or touched the destination plant at least once before. For the duration, any creature can step into the target plant and exit from the destination plant by using 5 feet of movement."
		],
		"tags": [
			"spell",
			"PHB'24",
			"6th level",
			"Conjuration",
			"Druid"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Tree Stride",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 5 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | You gain the ability to enter a tree and move from inside it to inside another tree of the same kind within 500 feet. Both trees must be living and at least the same size as you. You must use 5 feet of movement to enter a tree. You instantly know the location of all other trees of the same kind within 500 feet and, as part of the move used to enter the tree, can either pass into one of those trees or step out of the tree you're in. You appear in a spot of your choice within 5 feet of the destination tree, using another 5 feet of movement. If you have no movement left, you appear within 5 feet of the tree you entered.",
			"text | You can use this transportation ability only once on each of your turns. You must end each turn outside a tree."
		],
		"tags": [
			"spell",
			"PHB'24",
			"5th level",
			"Conjuration",
			"Druid",
			"Ranger",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "True Resurrection",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 9 Necromancy",
			"rule",
			"property | Casting Time | 1 hour",
			"property | Range | Touch",
			"property | Components | V, S, M (diamonds worth 25,000+ GP, which the spell consumes)",
			"property | Duration | Instantaneous",
			"rule",
			"text | You touch a creature that has been dead for no longer than 200 years and that died for any reason except old age. The creature is revived with all its Hit Points.",
			"text | This spell closes all wounds, neutralizes any poison, cures all magical contagions, and lifts any curses affecting the creature when it died. The spell replaces damaged or missing organs and limbs. If the creature was Undead, it is restored to its non-Undead form.",
			"text | The spell can provide a new body if the original no longer exists, in which case you must speak the creature's name. The creature then appears in an unoccupied space you choose within 10 feet of you."
		],
		"tags": [
			"spell",
			"PHB'24",
			"9th level",
			"Necromancy",
			"Cleric",
			"Druid"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Tsunami",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 8 Conjuration",
			"rule",
			"property | Casting Time | 1 minute",
			"property | Range | 1 mile",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 6 rounds",
			"rule",
			"text | A wall of water springs into existence at a point you choose within range. You can make the wall up to 300 feet long, 300 feet high, and 50 feet thick. The wall lasts for the duration.",
			"text | When the wall appears, each creature in its area makes a Strength saving throw, taking 6d10 Bludgeoning damage on a failed save or half as much damage on a successful one.",
			"text | At the start of each of your turns after the wall appears, the wall, along with any creatures in it, moves 50 feet away from you. Any Huge or smaller creature inside the wall or whose space the wall enters when it moves must succeed on a Strength saving throw or take 5d10 Bludgeoning damage. A creature can take this damage only once per round. At the end of the turn, the wall's height is reduced by 50 feet, and the damage the wall deals on later rounds is reduced by 1d10. When the wall reaches 0 feet in height, the spell ends.",
			"text | A creature caught in the wall can move by swimming. Because of the wave's force, though, the creature must succeed on a Strength (Athletics) check against your spell save DC to move at all. If it fails the check, it can't move. A creature that moves out of the wall falls to the ground."
		],
		"tags": [
			"spell",
			"PHB'24",
			"8th level",
			"Conjuration",
			"Druid",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Wall of Fire",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 4 Evocation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 120 feet",
			"property | Components | V, S, M (a piece of charcoal)",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | You create a wall of fire on a solid surface within range. You can make the wall up to 60 feet long, 20 feet high, and 1 foot thick, or a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall is opaque and lasts for the duration.",
			"text | When the wall appears, each creature in its area makes a Dexterity saving throw, taking 5d8 Fire damage on a failed save or half as much damage on a successful one.",
			"text | One side of the wall, selected by you when you cast this spell, deals 5d8 Fire damage to each creature that ends its turn within 10 feet of that side or inside the wall. A creature takes the same damage when it enters the wall for the first time on a turn or ends its turn there. The other side of the wall deals no damage.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | The damage increases by 1d8 for each spell slot level above 4."
		],
		"tags": [
			"spell",
			"PHB'24",
			"4th level",
			"Evocation",
			"Druid",
			"Sorcerer",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Wall of Stone",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 5 Evocation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 120 feet",
			"property | Components | V, S, M (a cube of granite)",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | A nonmagical wall of solid stone springs into existence at a point you choose within range. The wall is 6 inches thick and is composed of ten 10-foot-by-10-foot panels. Each panel must be contiguous with another panel. Alternatively, you can create 10-foot-by-20-foot panels that are only 3 inches thick.",
			"text | If the wall cuts through a creature's space when it appears, the creature is pushed to one side of the wall (you choose which side). If a creature would be surrounded on all sides by the wall (or the wall and another solid surface), that creature can make a Dexterity saving throw. On a success, it can use its Reaction to move up to its Speed so that it is no longer enclosed by the wall.",
			"text | The wall can have any shape you desire, though it can't occupy the same space as a creature or object. The wall doesn't need to be vertical or rest on a firm foundation. It must, however, merge with and be solidly supported by existing stone. Thus, you can use this spell to bridge a chasm or create a ramp.",
			"text | If you create a span greater than 20 feet in length, you must halve the size of each panel to create supports. You can crudely shape the wall to create battlements and the like.",
			"text | The wall is an object made of stone that can be damaged and thus breached. Each panel has AC 15 and 30 Hit Points per inch of thickness, and it has Immunity to Poison and Psychic damage. Reducing a panel to 0 Hit Points destroys it and might cause connected panels to collapse at the DM's discretion.",
			"text | If you maintain your Concentration on this spell for its full duration, the wall becomes permanent and can't be dispelled. Otherwise, the wall disappears when the spell ends."
		],
		"tags": [
			"spell",
			"PHB'24",
			"5th level",
			"Evocation",
			"Druid",
			"Sorcerer",
			"Wizard",
			"Artificer",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Wall of Thorns",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 6 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 120 feet",
			"property | Components | V, S, M (a handful of thorns)",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | You create a wall of tangled brush bristling with needle-sharp thorns. The wall appears within range on a solid surface and lasts for the duration. You choose to make the wall up to 60 feet long, 10 feet high, and 5 feet thick or a circle that has a 20-foot diameter and is up to 20 feet high and 5 feet thick. The wall blocks line of sight.",
			"text | When the wall appears, each creature in its area makes a Dexterity saving throw, taking 7d8 Piercing damage on a failed save or half as much damage on a successful one.",
			"text | A creature can move through the wall, albeit slowly and painfully. For every 1 foot a creature moves through the wall, it must spend 4 feet of movement. Furthermore, the first time a creature enters a space in the wall on a turn or ends its turn there, the creature makes a Dexterity saving throw, taking 7d8 Slashing damage on a failed save or half as much damage on a successful one. A creature makes this save only once per turn.",
			"section | At higher levels",
			"description | Using a Higher-Level Spell Slot | Both types of damage increase by 1d8 for each spell slot level above 6."
		],
		"tags": [
			"spell",
			"PHB'24",
			"6th level",
			"Conjuration",
			"Druid",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Wall of Water",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 3 Evocation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 60 feet",
			"property | Components | V, S, M (a drop of water)",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | You create a wall of water on the ground at a point you can see within range. You can make the wall up to 30 feet long, 10 feet high, and 1 foot thick, or you can make a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall vanishes when the spell ends. The wall's space is difficult terrain.",
			"text | Any ranged weapon attack that enters the wall's space has disadvantage on the attack roll, and fire damage is halved if the fire effect passes through the wall to reach its target. Spells that deal cold damage that pass through the wall cause the area of the wall they pass through to freeze solid (at least a 5-foot-square section is frozen). Each 5-foot-square frozen section has AC 5 and 15 hit points. Reducing a frozen section to 0 hit points destroys it. When a section is destroyed, the wall's water doesn't fill it."
		],
		"tags": [
			"spell",
			"XGE",
			"3rd level",
			"Evocation",
			"Druid",
			"Sorcerer",
			"Wizard",
			"Druid",
			"Sorcerer",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Warding Wind",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Evocation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | Self",
			"property | Components | V",
			"property | Duration | Concentration, up to 10 minutes",
			"rule",
			"text | A strong wind (20 miles per hour) blows around you in a 10-foot radius and moves with you, remaining centered on you. The wind lasts for the spell's duration.",
			"text | The wind has the following effects:",
			"bullet | It deafens you and other creatures in its area.",
			"bullet | It extinguishes unprotected flames in its area that are torch-sized or smaller.",
			"bullet | It hedges out vapor, gas, and fog that can be dispersed by strong wind.",
			"bullet | The area is difficult terrain for creatures other than you.",
			"bullet | The attack rolls of ranged weapon attacks have disadvantage if the attacks pass in or out of the wind."
		],
		"tags": [
			"spell",
			"XGE",
			"2nd level",
			"Evocation",
			"Bard",
			"Druid",
			"Sorcerer",
			"Wizard",
			"Bard",
			"Druid",
			"Sorcerer",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Water Breathing",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 3 Transmutation",
			"rule",
			"property | Casting Time | Action or Ritual",
			"property | Range | 30 feet",
			"property | Components | V, S, M (a short reed)",
			"property | Duration | 24 hours",
			"rule",
			"text | This spell grants up to ten willing creatures of your choice within range the ability to breathe underwater until the spell ends. Affected creatures also retain their normal mode of respiration."
		],
		"tags": [
			"spell",
			"PHB'24",
			"3rd level",
			"Transmutation",
			"Druid",
			"Ranger",
			"Sorcerer",
			"Wizard",
			"Artificer",
			"ritual"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Water Walk",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 3 Transmutation",
			"rule",
			"property | Casting Time | Action or Ritual",
			"property | Range | 30 feet",
			"property | Components | V, S, M (a piece of cork)",
			"property | Duration | 1 hour",
			"rule",
			"text | This spell grants the ability to move across any liquid surface—such as water, acid, mud, snow, quicksand, or lava—as if it were harmless solid ground (creatures crossing molten lava can still take damage from the heat). Up to ten willing creatures of your choice within range gain this ability for the duration.",
			"text | An affected target must take a Bonus Action to pass from the liquid's surface into the liquid itself and vice versa, but if the target falls into the liquid, the target passes through the surface into the liquid below."
		],
		"tags": [
			"spell",
			"PHB'24",
			"3rd level",
			"Transmutation",
			"Cleric",
			"Druid",
			"Ranger",
			"Sorcerer",
			"Artificer",
			"ritual"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Watery Sphere",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 4 Conjuration",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 90 feet",
			"property | Components | V, S, M (a droplet of water)",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | You conjure up a sphere of water with a 5-foot radius at a point you can see within range. The sphere can hover but no more than 10 feet off the ground. The sphere remains for the spell's duration.",
			"text | Any creature in the sphere's space must make a Strength saving throw. On a successful save, a creature is ejected from that space to the nearest unoccupied space of the creature's choice outside the sphere. A Huge or larger creature succeeds on the saving throw automatically, and a Large or smaller creature can choose to fail it. On a failed save, a creature is restrained by the sphere and is engulfed by the water. At the end of each of its turns, a restrained target can repeat the saving throw, ending the effect on itself on a success.",
			"text | The sphere can restrain as many as four Medium or smaller creatures or one Large creature. If the sphere restrains a creature that causes it to exceed this capacity, a random creature that was already restrained by the sphere falls out of it and lands prone in a space within 5 feet of it.",
			"text | As an action, you can move the sphere up to 30 feet in a straight line. If it moves over a pit, a cliff, or other drop-off, it safely descends until it is hovering 10 feet above the ground. Any creature restrained by the sphere moves with it. You can ram the sphere into creatures, forcing them to make the saving throw.",
			"text | When the spell ends, the sphere falls to the ground and extinguishes all normal flames within 30 feet of it. Any creature restrained by the sphere is knocked prone in the space where it falls. The water then vanishes."
		],
		"tags": [
			"spell",
			"XGE",
			"4th level",
			"Conjuration",
			"Druid",
			"Sorcerer",
			"Wizard",
			"Druid",
			"Sorcerer",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Whirlwind",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 7 Evocation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 300 feet",
			"property | Components | V, M (a piece of straw)",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | A whirlwind howls down to a point that you can see on the ground within range. The whirlwind is a 10-foot-radius, 30-foot-high cylinder centered on that point. Until the spell ends, you can use your action to move the whirlwind up to 30 feet in any direction along the ground. The whirlwind sucks up any Medium or smaller objects that aren't secured to anything and that aren't worn or carried by anyone.",
			"text | A creature must make a Dexterity saving throw the first time on a turn that it enters the whirlwind or that the whirlwind enters its space, including when the whirlwind first appears. A creature takes 10d6 bludgeoning damage on a failed save, or half as much damage on a successful one. In addition, a Large or smaller creature that fails the save must succeed on a Strength saving throw or become restrained in the whirlwind until the spell ends. When a creature starts its turn restrained by the whirlwind, the creature is pulled 5 feet higher inside it, unless the creature is at the top. A restrained creature moves with the whirlwind and falls when the spell ends, unless the creature has some means to stay aloft.",
			"text | A restrained creature can use an action to make a Strength or Dexterity check against your spell save DC. If successful, the creature is no longer restrained by the whirlwind and is hurled 3d6 × 10 feet away from it in a random direction."
		],
		"tags": [
			"spell",
			"XGE",
			"7th level",
			"Evocation",
			"Druid",
			"Sorcerer",
			"Wizard",
			"Druid",
			"Sorcerer",
			"Wizard",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Wind Walk",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 6 Transmutation",
			"rule",
			"property | Casting Time | 1 minute",
			"property | Range | 30 feet",
			"property | Components | V, S, M (a candle)",
			"property | Duration | 8 hours",
			"rule",
			"text | You and up to ten willing creatures of your choice within range assume gaseous forms for the duration, appearing as wisps of cloud. While in this cloud form, a target has a Fly Speed of 300 feet and can hover; it has Immunity to the Prone condition; and it has Resistance to Bludgeoning, Piercing, and Slashing damage. The only actions a target can take in this form are the Dash action or a Magic action to begin reverting to its normal form. Reverting takes 1 minute, during which the target has the Stunned condition. Until the spell ends, the target can revert to cloud form, which also requires a Magic action followed by a 1-minute transformation.",
			"text | If a target is in cloud form and flying when the effect ends, the target descends 60 feet per round for 1 minute until it lands, which it does safely. If it can't land after 1 minute, it falls the remaining distance."
		],
		"tags": [
			"spell",
			"PHB'24",
			"6th level",
			"Transmutation",
			"Druid"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Wind Wall",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 3 Evocation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 120 feet",
			"property | Components | V, S, M (a fan and a feather)",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | A wall of strong wind rises from the ground at a point you choose within range. You can make the wall up to 50 feet long, 15 feet high, and 1 foot thick. You can shape the wall in any way you choose so long as it makes one continuous path along the ground. The wall lasts for the duration.",
			"text | When the wall appears, each creature in its area makes a Strength saving throw, taking 4d8 Bludgeoning damage on a failed save or half as much damage on a successful one.",
			"text | The strong wind keeps fog, smoke, and other gases at bay. Small or smaller flying creatures or objects can't pass through the wall. Loose, lightweight materials brought into the wall fly upward. Arrows, bolts, and other ordinary projectiles launched at targets behind the wall are deflected upward and miss automatically. Boulders hurled by Giants or siege engines, and similar projectiles, are unaffected. Creatures in gaseous form can't pass through it."
		],
		"tags": [
			"spell",
			"PHB'24",
			"3rd level",
			"Evocation",
			"Druid",
			"Ranger",
			"concentration"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Wither and Bloom",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 2 Necromancy",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 60 feet",
			"property | Components | V, S, M (a withered vine twisted into a loop)",
			"property | Duration | Instantaneous",
			"rule",
			"text | You invoke both death and life upon a 10-foot-radius sphere centered on a point within range. Each creature of your choice in that area must make a Constitution saving throw, taking 2d6 necrotic damage on a failed save, or half as much damage on a successful one. Nonmagical vegetation in that area withers.",
			"text | In addition, one creature of your choice in that area can spend and roll one of its unspent Hit Dice and regain a number of hit points equal to the roll plus your spellcasting ability modifier.",
			"section | At higher levels",
			"text | When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d6 for each slot above the 2nd, and the number of Hit Dice that can be spent and added to the healing roll increases by one for each slot above 2nd."
		],
		"tags": [
			"spell",
			"SCC",
			"2nd level",
			"Necromancy",
			"Druid",
			"Sorcerer",
			"Wizard",
			"Druid",
			"Sorcerer",
			"Wizard"
		]
	},
	{
		"count": 1,
		"color": "#4a6898",
		"title": "Wrath of Nature",
		"icon": "magic-swirl",
		"icon_back": "magic-swirl",
		"contents": [
			"subtitle | Level 5 Evocation",
			"rule",
			"property | Casting Time | Action",
			"property | Range | 120 feet",
			"property | Components | V, S",
			"property | Duration | Concentration, up to 1 minute",
			"rule",
			"text | You call out to the spirits of nature to rouse them against your enemies. Choose a point you can see within range. The spirits cause trees, rocks, and grasses in a 60-foot cube centered on that point to become animated until the spell ends.",
			"description | Grasses and Undergrowth | Any area of ground in the cube that is covered by grass or undergrowth is difficult terrain for your enemies.",
			"description | Trees | At the start of each of your turns, each of your enemies within 10 feet of any tree in the cube must succeed on a Dexterity saving throw or take 4d6 slashing damage from whipping branches.",
			"description | Roots and Vines | At the end of each of your turns, one creature of your choice that is on the ground in the cube must succeed on a Strength saving throw or become restrained until the spell ends. A restrained creature can use an action to make a Strength (Athletics) check against your spell save DC, ending the effect on itself on a success.",
			"description | Rocks | As a bonus action on your turn, you can cause a loose rock in the cube to launch at a creature you can see in the cube. Make a ranged spell attack against the target. On a hit, the target takes 3d8 nonmagical bludgeoning damage, and it must succeed on a Strength saving throw or fall prone."
		],
		"tags": [
			"spell",
			"XGE",
			"5th level",
			"Evocation",
			"Druid",
			"Ranger",
			"Druid",
			"Ranger",
			"concentration"
		]
	}
]